[
    {
        "opinion_id": "3422858",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "UWAGA, UWAGA do wszystkich zgłaszających problem z jakością rozmów głosowych: niestety, spotkał mnie ten sam problem, telefon dostałem od jednego z głównych operatorów telefonii komorkówej w PL. zainteresowałem się tematem w internecie, głównie na anglojęzycznych forach, nikt praktycznie nie zgłaszał podobnych perpetii, a i tutaj, na ceneo, można było natknąć się na przeczące sobie opinie. Załóżyłem w związku z tym, że być może winny jest brandowany soft. Tak postawioną tezę postanowiłem sprawdzić empirycznie i wziałem się za wgranie czystego oprogramowania prosto od samsunga. Efekt? BINGO! jakość rozmów żyleta, tak więc zapraszam do lektury for androidowych jak sobie poradzić z debrandowaniem telefonu z androidem (generalnie bułka z masłem). pozdrawiam serdecznie! 5 gwiazdek, bo telefon sam w sobie nie jest niczemu winny. Za to programisci i testerzy naszych rodzimych operatorow juz tak:)",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 57,
        "vote_no": 7,
        "published": "2015-11-17 17:55:59",
        "purchased": null,
        "content_en": "Note, note to all reporting the problem with the quality of voice conversations: unfortunately, I met the same problem, I got the phone from one of the main mobile telephony operators in pl. I became interested in the subject on the internet, mainly in English -speaking forums, no one practically reported similar pertets, and here, on Ceneo, you could come across a negative reviews. Therefore, I arose that Soft is guilty. I decided to check the thesis empirically and started uploading clean software straight from Samsung. Effect? Bingo! The quality of Żyleta's conversations, so I invite you to read for Android how to deal with the debranding of the Android phone (generally a roll with butter). kind regards! 5 stars, because the phone itself is not guilty of anything. But the programmers and testers of our native operators already like this :)",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3529254",
        "author": "Marcin",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "Ogólnie spoko, chociaż telefon po wyjęciu z pudełka trafił do serwisu w celu wymiany wygiętej ramki, która powodowała odklejanie się wyświetlacza. Usterka usunięta w ciągu godziny po uprzednim zamówieniu części, za co ogromny plus dla autoryzowanego serwisu Unitra Eltron Serwis w Lublinie, że w ten sposób realizują naprawy (nie trzymają niepotrzebnie sprzętu w serwisie). Sam telefon bez zastrzeżeń, dokładnie to czego oczekiwałem. Minus jedynie za przycisk home, który trzeba dosyć mocno naciskać (w Note3 chodzi dużo lepiej). Całkiem wytrzymała bateria.",
        "pros_pl": [],
        "cons_pl": [
            "przycisk home - trzeba mocno naciskać"
        ],
        "vote_yes": 3,
        "vote_no": 0,
        "published": "2016-01-13 00:44:40",
        "purchased": "2015-12-27 14:12:05",
        "content_en": "Generally cool, although the phone after removing from the box went to the service to replace the bent frame, which caused the display to peel off. The defect removed within an hour after ordering the part, for which a huge plus for the authorized Unitra Eltron service service in Lublin, that in this way they carry out repairs (they do not keep the equipment unnecessarily on the site). The phone itself without reservations, exactly what I expected. Minus only for the Home button, which needs to be pressed quite strongly (it is much better in Note3). Quite durable battery.",
        "pros_en": [],
        "cons_en": [
            "Home button - you have to press hard"
        ]
    },
    {
        "opinion_id": "6706897",
        "author": "zedi",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Wady Słaby dźwięk z głośnika głównego - z tyłu, szybko padająca bateria. nagrzewa się niekiedy-  bez powodu, brak smartStay, co występuję w niektórych tańszych modeli Samsunga i u konkurencji, nakładka potrafi przymulić, u mnie problem z modułem BT.\r\n\r\nZalety:\r\nFunkcjonalność oprogramowania, aparaty foto, LTE, - na sofcie z T- Mobile jest o wiele lepiej, wyświetlacz - ładnie odwzorowane kolory, skromny design, tylna obudowa, czule mikrofony, ULTRA tryb oszczędzania energii -baterii, szybki  Soc - rodzimy Exynos via Samsung.",
        "pros_pl": [
            "ekran nie do zbicia",
            "wyświetlacza:  design:  żywotność"
        ],
        "cons_pl": [
            "bateria lądująca w godzine 100%",
            "czas pracy na baterii",
            "słaba jakość dźwięku z głośniczka",
            "wady oprogramowania",
            "wododporność"
        ],
        "vote_yes": 0,
        "vote_no": 2,
        "published": "2018-03-14 00:45:39",
        "purchased": null,
        "content_en": "Disadvantages poor sound from the main speaker - at the back, rapidly falling battery. It sometimes heats up- for no reason, lack of smartstay, which is found in some cheaper Samsung models and at competition, the overlay can forced, for me a problem with the BT module.\r\n\r\nAdvantages:\r\nThe functionality of the software, camera, LTE cameras, - on the software with t -mobile is much better, display - nicely reproduced colors, modest design, rear housing, tenderly microphones, ultra -high energy saving mode - batery, fast SoC - native Exynos via Samsung.",
        "pros_en": [
            "The screen is not beaten",
            "Display: Design: Life"
        ],
        "cons_en": [
            "battery landing 100%",
            "battery life",
            "poor sound quality from the speaker",
            "Software disadvantages",
            "resistance"
        ]
    },
    {
        "opinion_id": "3287614",
        "author": "maciej",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Generalnie bardzo dobry smartfon, moim zdaniem lepiej wykonana obudowa głównie jeśli chodzi o spasowanie elementów i ramkę otaczającą telefon. Plusem jest też procesor choć nie tak wydajny jak w starszej siostrze to wystarczający i nie powoduje takiego grzania obudowy jak w zwykłej s5. Działanie na baterii wygląda dobrze, po włączeniu miałem 44 procent po czym nastąpiła aktualizacja do 5.1.1 bawiłem się w ustawienia i sprawdzałem funkcje czyli użytkowany 20 godzin bardzo intensywnie. Zakładam że na moje potrzeby wytrzyma spokojnie dwa do trzech dni. Jedyny minus to nie zawsze reagujący przycisk fizyczny pod wyświetlaczem na komendę, myślę jednak że to nie wada samego przycisku a błąd softu który zostanie poprawiony przy aktualizacji.",
        "pros_pl": [
            "funkcjonalność"
        ],
        "cons_pl": [],
        "vote_yes": 35,
        "vote_no": 14,
        "published": "2015-08-21 14:25:23",
        "purchased": null,
        "content_en": "Generally, a very good smartphone, in my opinion, a better made housing mainly when it comes to folding the elements and a frame surrounding the phone. A plus is also a processor, although not as efficient as in an older sister it is enough and does not cause such heating the housing as in a regular S5. Operating on the battery looks good, after switching on I had 44 percent, and then the update up to 5.1.1 was played in the settings and checked the functions, i.e. used 20 hours very intensively. I assume that it will last calmly two to three days. The only minus is not always the reacting physical button under the display on the command, but I think that this is not the defect of the button itself but the software error that will be corrected when updating.",
        "pros_en": [
            "functionality"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "3580458",
        "author": "Janek",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Smartphone szybki i stabilny. Super ekran dotykowy. Aparat robi świetne zdjęcia.Przy normalnej eksploatacji bateria wystarcza na 2dni.Wszystkie pozostałe funkcje bez zarzutów. Jestem w pełni zadowolony.",
        "pros_pl": [
            "wyświetlacza:  design:  żywotność"
        ],
        "cons_pl": [],
        "vote_yes": 37,
        "vote_no": 16,
        "published": "2016-02-12 11:13:47",
        "purchased": "2016-01-25 12:30:40",
        "content_en": "Smartphone fast and stable. Super touch screen. The camera takes great photos. In normal operation, the battery is enough for 2 days. All other functions without any accusations. I am fully satisfied.",
        "pros_en": [
            "Display: Design: Life"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "3668612",
        "author": "aREk",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Po zmianie ze starego Samsunga S-Advance - bez porównania. Telefon działa prawidłowo, szybko, nie wiesza się. Menu bardzo intuicyjne. Wielki pozytyw. Przyzwyczajenie do Samsunga skłoniło do kolejnego Samsunga - nie zawiodłem się. Polecam wszystkim \"nie do końca\" zdecydowanym.",
        "pros_pl": [
            "funkcjonalność"
        ],
        "cons_pl": [],
        "vote_yes": 1,
        "vote_no": 1,
        "published": "2016-03-31 21:12:25",
        "purchased": "2016-03-23 11:23:35",
        "content_en": "After changing from the old Samsung S -Advance - without comparison. The phone works properly, quickly, does not hang. Very intuitive menu. Great positive. The habit of Samsung prompted another Samsung - I was not disappointed. I recommend \"not quite\" to everyone.",
        "pros_en": [
            "functionality"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "3621067",
        "author": "Mateusz",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "Super telefon nie zacina się, szybko się uruchamia ogólnie wszystko super, głośnik rewelacyjny.\nTylko szkoda że samsung nie zostawił mu aparatu 4K i czytnika lini papilarnych ale jedno mnie bardzo roszczarowało szybko bateria się rozładowuje max 1 dzień trzyma. Ale polecam !\n\nPOLECAM",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 9,
        "vote_no": 8,
        "published": "2016-03-03 21:57:18",
        "purchased": null,
        "content_en": "The great phone does not jam, it starts quickly, everything is great, the speaker is sensational.\nIt is a pity that Samsung did not leave him a 4K camera and a fingerprint reader but one thing was very clarified by the battery quickly discharges a maximum of 1 day holds. But I recommend it!\n\nI RECOMMEND",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3602206",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Kupiłem ten telefon praktycznie nowy 2 tygodniowy i wszystko jest tak jak powinno być. Nic się nie zacina, rozmowy są dobre, wiem że dużo osób miało problem z tym głośnikiem u mnie jest w porządku. Bateria trzyma spokojnie 2 dni przy dosyć sporym użytkowaniu i spędzaniu czasu na internecie. Zdjęcia robi bardzo dobrej jakości, jedyny minus to że obudowa tylna drga przy słuchaniu głośno muzyki. Moim zdaniem telefon zbyt drogi w sklepach jak np. Media Markt 1499zł lepiej znaleźć na Olx mi się udało kupić za 970zł i uważam że cena jest adekwatna   jak na ten smartfon, więcej niż  1000zł nie warto za niego wydawać hajsu. Więc każdemu mogę polecieć za rozsądną cenę pozdrawiam",
        "pros_pl": [
            "bateria dwa dni trzyma przy dość intensy"
        ],
        "cons_pl": [],
        "vote_yes": 7,
        "vote_no": 2,
        "published": "2016-02-24 16:08:31",
        "purchased": null,
        "content_en": "I bought this phone virtually a new 2 weekly and everything is as it should be. Nothing stutters, the conversations are good, I know that a lot of people had a problem with this speaker for me is fine. The battery keeps calmly 2 days with quite a lot of use and spending time on the Internet. Pictures take very good quality, the only minus is that the rear housing vibrate when listening to the music loudly. In my opinion, the phone is too expensive in stores such as Media Markt PLN 1499, it was better to find at OLX I managed to buy for PLN 970 and I think that the price is adequate for this smartphone, more than PLN 1000 it is not worth spending money for it. So I can fly to everyone for a reasonable price, best regards",
        "pros_en": [
            "The battery holds for two days at a fairly intersection"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "3341535",
        "author": "Pawel",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "Zamieniłem z Galaxy S Plus,  który jeszcze dawał sobie radę ale zamulał czasem S5 neo jeszcze się nie zająknął po wgraniu wielu apek.",
        "pros_pl": [],
        "cons_pl": [
            "bateria dwa dni trzyma przy dość intensy"
        ],
        "vote_yes": 12,
        "vote_no": 5,
        "published": "2015-09-28 09:31:30",
        "purchased": "2015-09-02 11:00:33",
        "content_en": "I exchanged from Galaxy S Plus, which still managed but sometimes s5 s5 neo has not stamped after uploading many apps.",
        "pros_en": [],
        "cons_en": [
            "The battery holds for two days at a fairly intersection"
        ]
    },
    {
        "opinion_id": "3836682",
        "author": "Maestro",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Poręczny estetyczny wygląd! Brak papierowej instrukcji co przy pierwszym użyciu produktu jest trudne w związku z wyborem języka i prawidłowej instalacji telefonu! Natomiast cała reszta jest ok!",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-07-21 18:17:58",
        "purchased": "2016-07-06 14:55:27",
        "content_en": "Handy aesthetic appearance! No paper instructions, which is difficult with the first use of the product when using the language and the correct installation of the phone! However, all the rest is ok!",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3421811",
        "author": "Tomek",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "Szukałem jego poprzednika, ale już go nie sprowadzają do sklepów (dziwna logika). Ale do rzeczy, przed kupnem naczytałem się recenzji i opinii i obawiałem się złej jakości rozmów - nic bardziej mylnego. Żona ma S5 i stwierdzamy, że jakość rozmów jest taka sama. Przesiadłem się z S3 mini więc wiadomo dużo szybszy i wydajniejszy. Bateria trzyma długo, nawet 4 dni (wyłączone dane komórkowe i mało używany) z LTE wczoraj przez 6h zjadło 40%. Brakuje mi tej podczerwieni (aplikacja pilot z programem telewizyjnym jest genialna). Prócz tego nie ma się czego przyczepić, sprzęt z górnej półki. Polecam.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 10,
        "vote_no": 1,
        "published": "2015-11-17 11:12:51",
        "purchased": null,
        "content_en": "I was looking for his predecessor, but they no longer bring him to stores (strange logic). But to the point, before buying, I read reviews and opinions and was afraid of poor quality conversations - nothing more wrong. The wife has S5 and we find that the quality of conversations is the same. I changed with S3 Mini so you know much faster and more efficient. The battery lasts a long, even 4 days (mobile data turned off and hardly used) with LTE yesterday for 6h ate 40%. I miss this infrared (the pilot application with the television program is brilliant). In addition, there is nothing to fault, top -shelf equipment. I recommend.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3982361",
        "author": "Ewa",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "Przepiękny wizualnie, mam go niedługo ale póki co wszystko działa w 100% bez najmniejszego przycinania się, mimo dużej ilości aplikacji.",
        "pros_pl": [
            "funkcjonalność"
        ],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-09-25 21:51:28",
        "purchased": "2016-09-12 16:53:59",
        "content_en": "Visually beautiful, I have it soon, but for now everything works 100% without the slightest trim, despite the large number of applications.",
        "pros_en": [
            "functionality"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "8486982",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Super telefon. Uzytkuje go od 3 lat.  Ani razu sie  nie zaciol. Ani razu nie zwolnil i nie zamulil. Wszystko wnim dziala jak nalezy. Zakupiony w sieci T-mobile. Dokupilem do niego orginalna obudowe neo hybrid spigena  co  nadalo telefonikowi indywidualny charakter.  I przez ten caly czas noszenia go w kieszeni nie starl sie lakier z ramki - niesamowite. Lepszego telefonu nie mialem.   Jedynu minus to polityka samsunga ktora przy aktualizacjach czyms musi \"postarzyc\" telefon.  bateria faktycznie trzyma jeden dzien ale to przeciez samsung :)  i nigdy lepiej nie bylo. Na plus moge zaliczyc ze nie zauwazylem starzenia sie baterii. Po takim okresie uzywania nadal zachowuje moc gdyby byla nowa.",
        "pros_pl": [
            "funkcjonalność",
            "wygląd"
        ],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2018-10-26 19:53:04",
        "purchased": null,
        "content_en": "Great phone. He has been using it for 3 years.  Not once is it. Not once did it slow down and did not soup. Everything works as it should be. Purchased in the T-Mobile network. I bought the original Neo Hybrid Spigen housing for it, which was still an individual character.  And during this time to wear it in your pocket, no varnish from the frame - amazing. I didn't have a better phone.   The one die is a Samsung's policy who must \"impress\" the phone when updating something.  The battery actually holds one day but it's Samsung :) and it was never better. On the plus side, I can include that I have not noticed the aging of the battery. After such a period of use, he still maintains power if it was new.",
        "pros_en": [
            "functionality",
            "appearance"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "3334116",
        "author": "Waldek",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Szukałem wydajnego smartfona do wszystkiego, za rozsądną cenę, z wymienną baterią i wejściem na kartę pamięci. Mój wybór to S5 Neo. Chyba się nie rozczaruję? Pozdrawiam!",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 3,
        "vote_no": 6,
        "published": "2015-09-22 14:17:51",
        "purchased": "2015-09-13 00:28:05",
        "content_en": "I was looking for an efficient smartphone for everything, for a reasonable price, with a replaceable battery and an entrance to the memory card. My choice is S5 Neo. I don't think I'll be disappointed? Regards!",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3665226",
        "author": "Łukasz",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Smartfona używam od 5 miesięcy. Optymalny rozmiar, bardzo dobry wyświetlacz, niezły czas pracy na baterii (wytrzymuje mi spokojnie od rana do wieczora przy intensywnym użytkowaniu), dobra jakość dźwięku (z zastrzeżeniem, że do zestawu dołączone są najbardziej prymitywne \"pchełki\", które warto czym prędzej wymienić na coś lepszego), jakość rozmów głosowych po aktualizacji oprogramowania bez zastrzeżeń (jedna z wcześniejszych aktualizacji była wadliwa i uniemożliwiła normalne prowadzenie rozmów) zapewniona aktualizacja Androida do wersji 6.0, płynność interfejsu dobra (przewijanie menu trochę klatkuje i nie jest to)",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 4,
        "vote_no": 0,
        "published": "2016-03-30 01:39:48",
        "purchased": null,
        "content_en": "I have been using a smartphone for 5 months. Optimal size, very good display, good battery life (it stands calmly from morning to evening with intensive use), good sound quality (with the proviso that the set includes the most primitive \"fleas\", which is worth exchanging for something better), the quality of voice conversations after updating the software without reservations (one of the previous updates was defective and prevented normal updates and prevented normal updates conversations) provided Android update to version 6.0, the liquidity of the good interface (scrolling of the menu cage a bit and it is not)",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3802566",
        "author": "Biały",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "Produkt chodzi płynnie nie zawiesza się aplikacje ładują się szybko. Parę bajerów umila życie np. pulsometr oraz wodo- i pyło- odporność",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-06-30 11:14:46",
        "purchased": "2016-06-26 18:40:16",
        "content_en": "The product goes smoothly does not hang the applications load quickly. A few goodies are made more pleasant by life, e.g. a heart rate monitor and water and dust- resistance",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3771522",
        "author": "Ania",
        "recommendation": null,
        "stars": 3.5,
        "content_pl": "Telefon z serii: fajny był jak był nowy. Niestety zawiodłam się bardzo na tym modelu w dłuższej perspektywie ponieważ ma problemy z łapaniem ostrości na zdjęciach, z tym że się często zacina i tym, robi czasem dziwne rzeczy takie jak odblokowuje się lub chce się wyłączyć z niewiadomych przyczyn. Fajny telefon ale nie jako odmiana flagowca, od tego poziomu (ceny) telefonu dużo więcej się wymaga. Kupiłam samsunga za namową znajomych i jako następny telefon na pewno samsunga nie wybiorę (albo wrócę do Sony, albo przejdę na iPhone)",
        "pros_pl": [
            "funkcjonalność"
        ],
        "cons_pl": [
            "po pół roku użytkowania się zawiesza"
        ],
        "vote_yes": 3,
        "vote_no": 0,
        "published": "2016-06-04 17:38:30",
        "purchased": null,
        "content_en": "The phone from the series: It was cool when he was new. Unfortunately, I was very disappointed in this model in the long run because it has problems with catching sharpness in the pictures, except that it often stresses and sometimes does strange things such as it unlocked or wants to turn off for unknown reasons. Nice phone but not as a flagship variety, much more is required from this level (price) of the phone. I bought Samsung at the instigation of my friends and as the next phone I will definitely not choose Samsung (either I will go back to Sony or go to the iPhone)",
        "pros_en": [
            "functionality"
        ],
        "cons_en": [
            "After half a year of use, it hangs"
        ]
    },
    {
        "opinion_id": "4150190",
        "author": "Mariusz",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Samsung Galaxy S5 Neo który zakupiłem kilka dni temu sprawuje się bardzo dobrze, jest szybki, menu przejrzyste i estetyczne. Polecam.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-11-04 15:43:21",
        "purchased": "2016-10-25 21:28:30",
        "content_en": "Samsung Galaxy S5 Neo that I bought a few days ago works very well, is fast, transparent and aesthetic menu. I recommend.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4034143",
        "author": "madebyme2212",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Jestem z niego bardzo zadowolona. Bateria trzyma 2 dni, zdjęcia ładne. Menu proste. Mogę z czystym sumieniem polecić ten model.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-10-11 11:33:40",
        "purchased": "2016-09-28 14:46:46",
        "content_en": "I am very happy with it. The battery holds 2 days, nice photos. Simple menu. I can recommend this model with a clear conscience.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3735102",
        "author": "Norbert",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Pierwsze wrażenie pozytywne. Czas pokaże czy takie odczucie zostanie na stałe.",
        "pros_pl": [
            "funkcjonalność"
        ],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-05-09 11:23:23",
        "purchased": "2016-05-01 16:01:26",
        "content_en": "The first positive impression. Time will tell if such a feeling will stay permanently.",
        "pros_en": [
            "functionality"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "3422858",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "UWAGA, UWAGA do wszystkich zgłaszających problem z jakością rozmów głosowych: niestety, spotkał mnie ten sam problem, telefon dostałem od jednego z głównych operatorów telefonii komorkówej w PL. zainteresowałem się tematem w internecie, głównie na anglojęzycznych forach, nikt praktycznie nie zgłaszał podobnych perpetii, a i tutaj, na ceneo, można było natknąć się na przeczące sobie opinie. Załóżyłem w związku z tym, że być może winny jest brandowany soft. Tak postawioną tezę postanowiłem sprawdzić empirycznie i wziałem się za wgranie czystego oprogramowania prosto od samsunga. Efekt? BINGO! jakość rozmów żyleta, tak więc zapraszam do lektury for androidowych jak sobie poradzić z debrandowaniem telefonu z androidem (generalnie bułka z masłem). pozdrawiam serdecznie! 5 gwiazdek, bo telefon sam w sobie nie jest niczemu winny. Za to programisci i testerzy naszych rodzimych operatorow juz tak:)",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 57,
        "vote_no": 7,
        "published": "2015-11-17 17:55:59",
        "purchased": null,
        "content_en": "Note, note to all reporting the problem with the quality of voice conversations: unfortunately, I met the same problem, I got the phone from one of the main mobile telephony operators in pl. I became interested in the subject on the internet, mainly in English -speaking forums, no one practically reported similar pertets, and here, on Ceneo, you could come across a negative reviews. Therefore, I arose that Soft is guilty. I decided to check the thesis empirically and started uploading clean software straight from Samsung. Effect? Bingo! The quality of Żyleta's conversations, so I invite you to read for Android how to deal with the debranding of the Android phone (generally a roll with butter). kind regards! 5 stars, because the phone itself is not guilty of anything. But the programmers and testers of our native operators already like this :)",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3330673",
        "author": "F",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "ekonomiczna ewolucja wersji s5... generalnie udany telefon w dobrej cenie. na plus nieco lepszy aparat, ale nieznacznie. brak pilota na podczerwień. Chodzi płynnie nie czuć braku mocy w normalnym użytkowaniu. Pod tym kątem prawie jak S6. Słabsze podzespoły ujawniają się dopiero przy grach. Oczywiście nie stanowią problemu. Jeśli ktoś ma jednak możliwość, niech wybierze lepiej \"stary\" S5.  Będzie to korzystniejsze. Menu w S5 o wiele bardziej bogate a działa równie dobrze. W całej sprawie ważna jest także polityka samsunga. .. który telefon dostanie   aktualizacje do androida M ???\nGdybym miał jeszcze raz wybierać to chyba jednak S5... ale nie żałuję, S5 neo jest równie Dobry!",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 4,
        "vote_no": 4,
        "published": "2015-09-20 08:13:53",
        "purchased": null,
        "content_en": "Economic evolution of the S5 version ... generally a successful phone at a good price. A slightly better camera, but slightly. No infrared remote control. It goes smoothly not to feel the lack of power in normal use. In this respect, almost like S6. Weaker components are only revealed in games. Of course, they are not a problem. However, if someone has the opportunity, let them choose the \"old\" S5 better.  It will be more favorable. The menu in S5 is much more rich and works equally well. Samsung's policy is also important in the whole matter. .. Which phone will get updates to Android m ???\nIf I had to choose again, I think S5 ... But I don't regret it, S5 NEO is equally good!",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3688463",
        "author": "Łukasz",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "Duży ekran, telefon w trybie oszczędzania energii trzyma 2-3 dni co wydaje mi się dobrym wynikiem.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 4,
        "vote_no": 2,
        "published": "2016-04-11 14:47:16",
        "purchased": "2016-03-30 22:05:22",
        "content_en": "A large screen, the phone in energy saving keeps 2-3 days, which seems to me a good result.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3529254",
        "author": "Marcin",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "Ogólnie spoko, chociaż telefon po wyjęciu z pudełka trafił do serwisu w celu wymiany wygiętej ramki, która powodowała odklejanie się wyświetlacza. Usterka usunięta w ciągu godziny po uprzednim zamówieniu części, za co ogromny plus dla autoryzowanego serwisu Unitra Eltron Serwis w Lublinie, że w ten sposób realizują naprawy (nie trzymają niepotrzebnie sprzętu w serwisie). Sam telefon bez zastrzeżeń, dokładnie to czego oczekiwałem. Minus jedynie za przycisk home, który trzeba dosyć mocno naciskać (w Note3 chodzi dużo lepiej). Całkiem wytrzymała bateria.",
        "pros_pl": [],
        "cons_pl": [
            "przycisk home - trzeba mocno naciskać"
        ],
        "vote_yes": 3,
        "vote_no": 0,
        "published": "2016-01-13 00:44:40",
        "purchased": "2015-12-27 14:12:05",
        "content_en": "Generally cool, although the phone after removing from the box went to the service to replace the bent frame, which caused the display to peel off. The defect removed within an hour after ordering the part, for which a huge plus for the authorized Unitra Eltron service service in Lublin, that in this way they carry out repairs (they do not keep the equipment unnecessarily on the site). The phone itself without reservations, exactly what I expected. Minus only for the Home button, which needs to be pressed quite strongly (it is much better in Note3). Quite durable battery.",
        "pros_en": [],
        "cons_en": [
            "Home button - you have to press hard"
        ]
    },
    {
        "opinion_id": "3315223",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": 3.0,
        "content_pl": "Wszystko ładnie pięknie tak jak na flagowca przystało (płynność systemu i super amoled) + dobrze działające radio FM, rzec by można super urządzenie. Niestety telefon (być może tylko mój egzemplarz) posiada fatalną jakość połączeń głosowych. Moi rozmówcy skarżą się, że bardzo słabo mnie słychać (jakby coś przysłaniało mikrofon, może wada mikrofonu) ja za to słyszałem ich głos wyraźnie ale chropowato. W porównaniu z moim starym galaxy core jakość rozmów jest fatalna. Nie wiem czy nie jest to spowodowane tym, że telefon jest wodoodporny, ale jeżeli tak to niestety bardzo na tym traci jakość fonii.",
        "pros_pl": [],
        "cons_pl": [
            "słaba jakość dźwięku z głośniczka"
        ],
        "vote_yes": 12,
        "vote_no": 15,
        "published": "2015-09-10 12:22:23",
        "purchased": null,
        "content_en": "Everything is nicely beautiful, as befits a flagship (system liquidity and Super AMOLED) + well -functioning FM radio, say a great device. Unfortunately, the phone (perhaps only my copy) has a terrible quality of voice calls. My interlocutors complain that I can hear very poorly (as if something was obscured by a microphone, maybe a microphone defect) I heard their voice clearly but rough. Compared to my old Galaxy Core, the quality of conversations is fatal. I do not know if it is due to the fact that the phone is waterproof, but if so, unfortunately it loses the quality of the phonia very much.",
        "pros_en": [],
        "cons_en": [
            "poor sound quality from the speaker"
        ]
    },
    {
        "opinion_id": "3480187",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "DO WSZYSTKICH MAJĄCYCH PROBLEM Z FATALNĄ JAKOŚCIĄ ROZMÓW!!!\r\nProblem leży po stronie operatora i dotyczy tylko PLAY! Wystarczy WYŁĄCZYĆ TRANSMISJĘ DANYCH i jakość diametralnie się zmienia!\r\nJest to wina PLAYa, który nic z tym nie robi i dotyczy to najnowszych softów Samsunga. Najwidoczniej szanowny operator nie nadąża za najnowszymi aktualizacjami Samsaunga i całkowicie olewa klientów!!!!!",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 17,
        "vote_no": 2,
        "published": "2015-12-17 08:51:17",
        "purchased": null,
        "content_en": "For all those with trouble with terrible conversations !!!\r\nThe problem lies with the operator and only applies to Play! Just turn off the data transmission and the quality changes radically!\r\nIt is Playa's fault, which does nothing about it and this applies to the latest Samsung software. Apparently, the honorable operator does not keep up with the latest Samsaang updates and completely oils customers !!!!!",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "6706897",
        "author": "zedi",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Wady Słaby dźwięk z głośnika głównego - z tyłu, szybko padająca bateria. nagrzewa się niekiedy-  bez powodu, brak smartStay, co występuję w niektórych tańszych modeli Samsunga i u konkurencji, nakładka potrafi przymulić, u mnie problem z modułem BT.\r\n\r\nZalety:\r\nFunkcjonalność oprogramowania, aparaty foto, LTE, - na sofcie z T- Mobile jest o wiele lepiej, wyświetlacz - ładnie odwzorowane kolory, skromny design, tylna obudowa, czule mikrofony, ULTRA tryb oszczędzania energii -baterii, szybki  Soc - rodzimy Exynos via Samsung.",
        "pros_pl": [
            "ekran nie do zbicia",
            "wyświetlacza:  design:  żywotność"
        ],
        "cons_pl": [
            "bateria lądująca w godzine 100%",
            "czas pracy na baterii",
            "słaba jakość dźwięku z głośniczka",
            "wady oprogramowania",
            "wododporność"
        ],
        "vote_yes": 0,
        "vote_no": 2,
        "published": "2018-03-14 00:45:39",
        "purchased": null,
        "content_en": "Disadvantages poor sound from the main speaker - at the back, rapidly falling battery. It sometimes heats up- for no reason, lack of smartstay, which is found in some cheaper Samsung models and at competition, the overlay can forced, for me a problem with the BT module.\r\n\r\nAdvantages:\r\nThe functionality of the software, camera, LTE cameras, - on the software with t -mobile is much better, display - nicely reproduced colors, modest design, rear housing, tenderly microphones, ultra -high energy saving mode - batery, fast SoC - native Exynos via Samsung.",
        "pros_en": [
            "The screen is not beaten",
            "Display: Design: Life"
        ],
        "cons_en": [
            "battery landing 100%",
            "battery life",
            "poor sound quality from the speaker",
            "Software disadvantages",
            "resistance"
        ]
    },
    {
        "opinion_id": "3287614",
        "author": "maciej",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Generalnie bardzo dobry smartfon, moim zdaniem lepiej wykonana obudowa głównie jeśli chodzi o spasowanie elementów i ramkę otaczającą telefon. Plusem jest też procesor choć nie tak wydajny jak w starszej siostrze to wystarczający i nie powoduje takiego grzania obudowy jak w zwykłej s5. Działanie na baterii wygląda dobrze, po włączeniu miałem 44 procent po czym nastąpiła aktualizacja do 5.1.1 bawiłem się w ustawienia i sprawdzałem funkcje czyli użytkowany 20 godzin bardzo intensywnie. Zakładam że na moje potrzeby wytrzyma spokojnie dwa do trzech dni. Jedyny minus to nie zawsze reagujący przycisk fizyczny pod wyświetlaczem na komendę, myślę jednak że to nie wada samego przycisku a błąd softu który zostanie poprawiony przy aktualizacji.",
        "pros_pl": [
            "funkcjonalność"
        ],
        "cons_pl": [],
        "vote_yes": 35,
        "vote_no": 14,
        "published": "2015-08-21 14:25:23",
        "purchased": null,
        "content_en": "Generally, a very good smartphone, in my opinion, a better made housing mainly when it comes to folding the elements and a frame surrounding the phone. A plus is also a processor, although not as efficient as in an older sister it is enough and does not cause such heating the housing as in a regular S5. Operating on the battery looks good, after switching on I had 44 percent, and then the update up to 5.1.1 was played in the settings and checked the functions, i.e. used 20 hours very intensively. I assume that it will last calmly two to three days. The only minus is not always the reacting physical button under the display on the command, but I think that this is not the defect of the button itself but the software error that will be corrected when updating.",
        "pros_en": [
            "functionality"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "3580458",
        "author": "Janek",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Smartphone szybki i stabilny. Super ekran dotykowy. Aparat robi świetne zdjęcia.Przy normalnej eksploatacji bateria wystarcza na 2dni.Wszystkie pozostałe funkcje bez zarzutów. Jestem w pełni zadowolony.",
        "pros_pl": [
            "wyświetlacza:  design:  żywotność"
        ],
        "cons_pl": [],
        "vote_yes": 37,
        "vote_no": 16,
        "published": "2016-02-12 11:13:47",
        "purchased": "2016-01-25 12:30:40",
        "content_en": "Smartphone fast and stable. Super touch screen. The camera takes great photos. In normal operation, the battery is enough for 2 days. All other functions without any accusations. I am fully satisfied.",
        "pros_en": [
            "Display: Design: Life"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "6275279",
        "author": "mmyy66",
        "recommendation": null,
        "stars": 3.0,
        "content_pl": "Gdyby ktoś jeszcze raz zaproponował mi ten telefon, nie zdecydowałabym się na niego. \r\nTelefon już po pół roku użytkowania zaczął się zacinać, samoistne wyłączać lub po prostu ekran stawał się cały czarny (ani włączyć, ani wyłączyć), 2 x usunął mi całą muzykę oraz zdjęcia z telefonu.\r\nPo przywróceniu ustawień fabrycznych  stan się poprawiał na kilka dni, a później znów to samo. Zaletą jest,że telefon jest nie do pobicia. Po całym dniu zacinania, zdarzyło mi się nim rzucić o ścianę, a mimo wszystko telefon jest cały i nie ma na nim ani jednej rysy . (nie naklejałam szkła hartowanego). Zdarza się nim zrobić naprawdę profesjonalne zdjęcia (światło dzienne) jak \"załapie\". I ostatni pozytyw to bateria, która przy \"siedzeniu\" cały dzień na telefonie ( o ile pół dnia się nie zacina), spokojnie wytrzymuje do późnego wieczora.",
        "pros_pl": [
            "czas pracy na baterii",
            "ekran nie do zbicia",
            "łatwość obsługi",
            "wygląd"
        ],
        "cons_pl": [
            "bateria lądująca w godzine 100%",
            "funkcjonalność",
            "nie daje rady z wieloma aplikacjami",
            "sam nie raz się wyłączył",
            "zacina się"
        ],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-11-30 15:07:56",
        "purchased": null,
        "content_en": "If someone offered me this phone again, I wouldn't decide on it. \r\nAfter half a year of use, the phone began to stuck, turn off, or simply the screen became all black (neither turn on or off), 2 x removed all the music and photos from the phone.\r\nAfter restoring the factory settings, the condition improved for a few days, and then the same again. The advantage is that the phone is unbeatable. After a whole day of jamming, I happened to throw it against the wall, and yet the phone is all and there is not a single scratch on it. (I did not stick tempered glass). It happens to take really professional photos (daylight) like \"Into\". And the last positive is the battery, which, when \"seating\" all day on the phone (if it does not stutter half a day), calmly lasts until late evening.",
        "pros_en": [
            "battery life",
            "The screen is not beaten",
            "ease of use",
            "appearance"
        ],
        "cons_en": [
            "battery landing 100%",
            "functionality",
            "it can't cope with many applications",
            "He turned off himself more than once",
            "jam"
        ]
    },
    {
        "opinion_id": "4003926",
        "author": "Jakub",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Jak na razie sprawuje się rewelacyjnie",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-10-03 17:10:08",
        "purchased": "2016-09-22 09:44:14",
        "content_en": "So far it works great",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3668612",
        "author": "aREk",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Po zmianie ze starego Samsunga S-Advance - bez porównania. Telefon działa prawidłowo, szybko, nie wiesza się. Menu bardzo intuicyjne. Wielki pozytyw. Przyzwyczajenie do Samsunga skłoniło do kolejnego Samsunga - nie zawiodłem się. Polecam wszystkim \"nie do końca\" zdecydowanym.",
        "pros_pl": [
            "funkcjonalność"
        ],
        "cons_pl": [],
        "vote_yes": 1,
        "vote_no": 1,
        "published": "2016-03-31 21:12:25",
        "purchased": "2016-03-23 11:23:35",
        "content_en": "After changing from the old Samsung S -Advance - without comparison. The phone works properly, quickly, does not hang. Very intuitive menu. Great positive. The habit of Samsung prompted another Samsung - I was not disappointed. I recommend \"not quite\" to everyone.",
        "pros_en": [
            "functionality"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "3621067",
        "author": "Mateusz",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "Super telefon nie zacina się, szybko się uruchamia ogólnie wszystko super, głośnik rewelacyjny.\nTylko szkoda że samsung nie zostawił mu aparatu 4K i czytnika lini papilarnych ale jedno mnie bardzo roszczarowało szybko bateria się rozładowuje max 1 dzień trzyma. Ale polecam !\n\nPOLECAM",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 9,
        "vote_no": 8,
        "published": "2016-03-03 21:57:18",
        "purchased": null,
        "content_en": "The great phone does not jam, it starts quickly, everything is great, the speaker is sensational.\nIt is a pity that Samsung did not leave him a 4K camera and a fingerprint reader but one thing was very clarified by the battery quickly discharges a maximum of 1 day holds. But I recommend it!\n\nI RECOMMEND",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3694882",
        "author": "Stanisław",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "Tak, jak w opisie danych technicznych",
        "pros_pl": [
            "funkcjonalność"
        ],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 5,
        "published": "2016-04-15 08:50:41",
        "purchased": "2016-04-09 09:16:26",
        "content_en": "As in the description of technical data",
        "pros_en": [
            "functionality"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "4506974",
        "author": "Wonski",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Zajefajny telefonik za rozsądną cenę.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-03-20 20:59:47",
        "purchased": "2017-03-08 22:49:08",
        "content_en": "A cool phone at a reasonable price.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3602206",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Kupiłem ten telefon praktycznie nowy 2 tygodniowy i wszystko jest tak jak powinno być. Nic się nie zacina, rozmowy są dobre, wiem że dużo osób miało problem z tym głośnikiem u mnie jest w porządku. Bateria trzyma spokojnie 2 dni przy dosyć sporym użytkowaniu i spędzaniu czasu na internecie. Zdjęcia robi bardzo dobrej jakości, jedyny minus to że obudowa tylna drga przy słuchaniu głośno muzyki. Moim zdaniem telefon zbyt drogi w sklepach jak np. Media Markt 1499zł lepiej znaleźć na Olx mi się udało kupić za 970zł i uważam że cena jest adekwatna   jak na ten smartfon, więcej niż  1000zł nie warto za niego wydawać hajsu. Więc każdemu mogę polecieć za rozsądną cenę pozdrawiam",
        "pros_pl": [
            "bateria dwa dni trzyma przy dość intensy"
        ],
        "cons_pl": [],
        "vote_yes": 7,
        "vote_no": 2,
        "published": "2016-02-24 16:08:31",
        "purchased": null,
        "content_en": "I bought this phone virtually a new 2 weekly and everything is as it should be. Nothing stutters, the conversations are good, I know that a lot of people had a problem with this speaker for me is fine. The battery keeps calmly 2 days with quite a lot of use and spending time on the Internet. Pictures take very good quality, the only minus is that the rear housing vibrate when listening to the music loudly. In my opinion, the phone is too expensive in stores such as Media Markt PLN 1499, it was better to find at OLX I managed to buy for PLN 970 and I think that the price is adequate for this smartphone, more than PLN 1000 it is not worth spending money for it. So I can fly to everyone for a reasonable price, best regards",
        "pros_en": [
            "The battery holds for two days at a fairly intersection"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "3809255",
        "author": "Łukasz",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Co prawda jest to już starszy model, ale w zupełności spełnia moje oczekiwania. Nie przepadam za telefonami szklanymi i metalowymi, więc plastikowy tył telefonu oceniam jako plus. Bateria jak na parametry telefonu mogła by być trochę pojemniejsza, ale za to szybko się ładuje. Jasny ekran, pełny kolorów ekran (o ekranie można w zasadzie pisać w samych superlatywach).",
        "pros_pl": [
            "funkcjonalność"
        ],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-07-04 15:11:17",
        "purchased": "2016-06-28 15:38:06",
        "content_en": "It is true that it is already an older model, but it completely meets my expectations. I do not like glass and metal phones, so I assess the plastic back of the phone as a plus. The battery for the phone parameters could be a little more spacious, but it charges quickly. A bright screen, full screen color (you can basically write about the screen in superlatives).",
        "pros_en": [
            "functionality"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "3341535",
        "author": "Pawel",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "Zamieniłem z Galaxy S Plus,  który jeszcze dawał sobie radę ale zamulał czasem S5 neo jeszcze się nie zająknął po wgraniu wielu apek.",
        "pros_pl": [],
        "cons_pl": [
            "bateria dwa dni trzyma przy dość intensy"
        ],
        "vote_yes": 12,
        "vote_no": 5,
        "published": "2015-09-28 09:31:30",
        "purchased": "2015-09-02 11:00:33",
        "content_en": "I exchanged from Galaxy S Plus, which still managed but sometimes s5 s5 neo has not stamped after uploading many apps.",
        "pros_en": [],
        "cons_en": [
            "The battery holds for two days at a fairly intersection"
        ]
    },
    {
        "opinion_id": "3945464",
        "author": "sernik",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Spoko tel.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-09-13 19:42:56",
        "purchased": "2016-09-03 22:46:38",
        "content_en": "Cool tel.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3836682",
        "author": "Maestro",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Poręczny estetyczny wygląd! Brak papierowej instrukcji co przy pierwszym użyciu produktu jest trudne w związku z wyborem języka i prawidłowej instalacji telefonu! Natomiast cała reszta jest ok!",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-07-21 18:17:58",
        "purchased": "2016-07-06 14:55:27",
        "content_en": "Handy aesthetic appearance! No paper instructions, which is difficult with the first use of the product when using the language and the correct installation of the phone! However, all the rest is ok!",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3421811",
        "author": "Tomek",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "Szukałem jego poprzednika, ale już go nie sprowadzają do sklepów (dziwna logika). Ale do rzeczy, przed kupnem naczytałem się recenzji i opinii i obawiałem się złej jakości rozmów - nic bardziej mylnego. Żona ma S5 i stwierdzamy, że jakość rozmów jest taka sama. Przesiadłem się z S3 mini więc wiadomo dużo szybszy i wydajniejszy. Bateria trzyma długo, nawet 4 dni (wyłączone dane komórkowe i mało używany) z LTE wczoraj przez 6h zjadło 40%. Brakuje mi tej podczerwieni (aplikacja pilot z programem telewizyjnym jest genialna). Prócz tego nie ma się czego przyczepić, sprzęt z górnej półki. Polecam.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 10,
        "vote_no": 1,
        "published": "2015-11-17 11:12:51",
        "purchased": null,
        "content_en": "I was looking for his predecessor, but they no longer bring him to stores (strange logic). But to the point, before buying, I read reviews and opinions and was afraid of poor quality conversations - nothing more wrong. The wife has S5 and we find that the quality of conversations is the same. I changed with S3 Mini so you know much faster and more efficient. The battery lasts a long, even 4 days (mobile data turned off and hardly used) with LTE yesterday for 6h ate 40%. I miss this infrared (the pilot application with the television program is brilliant). In addition, there is nothing to fault, top -shelf equipment. I recommend.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3920337",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Nie słyszę problemów z jakością połączeń głosowych a słuch mam dobry. Przyznam, że wogóle telefony jak na ich cenę i zaawansowanie techniczne całej infrastruktury telefonicznej prezentują marną jakość rozmów. Dźwięk w telefonie jest lepszy od mojego poprzedniego telefonu, swoją drogą topowego, Sony Ericsson W995 więc nie mam zastrzeżeń. Poza tym za tą cenę telefon jest na prawdę dobry pod każdym względem. Najbardziej miło zaskoczył mnie aparat przedni.",
        "pros_pl": [
            "funkcjonalność",
            "wododporność"
        ],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-09-03 10:13:23",
        "purchased": null,
        "content_en": "I don't hear problems with the quality of voice connections and I have a good hearing. I admit that at all, phones as at the price and technical advancement of the entire telephone infrastructure present a poor quality of conversations. The sound on the phone is better than my previous phone, by the way top, Sony Ericsson W995 so I have no objections. Besides, for this price the phone is really good in every respect. The front camera surprised me the most.",
        "pros_en": [
            "functionality",
            "resistance"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "3982361",
        "author": "Ewa",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "Przepiękny wizualnie, mam go niedługo ale póki co wszystko działa w 100% bez najmniejszego przycinania się, mimo dużej ilości aplikacji.",
        "pros_pl": [
            "funkcjonalność"
        ],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-09-25 21:51:28",
        "purchased": "2016-09-12 16:53:59",
        "content_en": "Visually beautiful, I have it soon, but for now everything works 100% without the slightest trim, despite the large number of applications.",
        "pros_en": [
            "functionality"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "4148150",
        "author": "Pawel",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Ok",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-11-03 20:04:49",
        "purchased": "2016-10-22 23:19:04",
        "content_en": "Ok",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3572891",
        "author": "An...",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "OKI !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!1",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 2,
        "vote_no": 18,
        "published": "2016-02-08 14:46:12",
        "purchased": "2016-01-15 15:43:51",
        "content_en": "Oki !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! 1",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3745544",
        "author": "bartek",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "dobre",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 1,
        "vote_no": 3,
        "published": "2016-05-15 20:48:30",
        "purchased": "2016-04-25 10:01:20",
        "content_en": "Good",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "8486982",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Super telefon. Uzytkuje go od 3 lat.  Ani razu sie  nie zaciol. Ani razu nie zwolnil i nie zamulil. Wszystko wnim dziala jak nalezy. Zakupiony w sieci T-mobile. Dokupilem do niego orginalna obudowe neo hybrid spigena  co  nadalo telefonikowi indywidualny charakter.  I przez ten caly czas noszenia go w kieszeni nie starl sie lakier z ramki - niesamowite. Lepszego telefonu nie mialem.   Jedynu minus to polityka samsunga ktora przy aktualizacjach czyms musi \"postarzyc\" telefon.  bateria faktycznie trzyma jeden dzien ale to przeciez samsung :)  i nigdy lepiej nie bylo. Na plus moge zaliczyc ze nie zauwazylem starzenia sie baterii. Po takim okresie uzywania nadal zachowuje moc gdyby byla nowa.",
        "pros_pl": [
            "funkcjonalność",
            "wygląd"
        ],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2018-10-26 19:53:04",
        "purchased": null,
        "content_en": "Great phone. He has been using it for 3 years.  Not once is it. Not once did it slow down and did not soup. Everything works as it should be. Purchased in the T-Mobile network. I bought the original Neo Hybrid Spigen housing for it, which was still an individual character.  And during this time to wear it in your pocket, no varnish from the frame - amazing. I didn't have a better phone.   The one die is a Samsung's policy who must \"impress\" the phone when updating something.  The battery actually holds one day but it's Samsung :) and it was never better. On the plus side, I can include that I have not noticed the aging of the battery. After such a period of use, he still maintains power if it was new.",
        "pros_en": [
            "functionality",
            "appearance"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "3334116",
        "author": "Waldek",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Szukałem wydajnego smartfona do wszystkiego, za rozsądną cenę, z wymienną baterią i wejściem na kartę pamięci. Mój wybór to S5 Neo. Chyba się nie rozczaruję? Pozdrawiam!",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 3,
        "vote_no": 6,
        "published": "2015-09-22 14:17:51",
        "purchased": "2015-09-13 00:28:05",
        "content_en": "I was looking for an efficient smartphone for everything, for a reasonable price, with a replaceable battery and an entrance to the memory card. My choice is S5 Neo. I don't think I'll be disappointed? Regards!",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3665226",
        "author": "Łukasz",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Smartfona używam od 5 miesięcy. Optymalny rozmiar, bardzo dobry wyświetlacz, niezły czas pracy na baterii (wytrzymuje mi spokojnie od rana do wieczora przy intensywnym użytkowaniu), dobra jakość dźwięku (z zastrzeżeniem, że do zestawu dołączone są najbardziej prymitywne \"pchełki\", które warto czym prędzej wymienić na coś lepszego), jakość rozmów głosowych po aktualizacji oprogramowania bez zastrzeżeń (jedna z wcześniejszych aktualizacji była wadliwa i uniemożliwiła normalne prowadzenie rozmów) zapewniona aktualizacja Androida do wersji 6.0, płynność interfejsu dobra (przewijanie menu trochę klatkuje i nie jest to)",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 4,
        "vote_no": 0,
        "published": "2016-03-30 01:39:48",
        "purchased": null,
        "content_en": "I have been using a smartphone for 5 months. Optimal size, very good display, good battery life (it stands calmly from morning to evening with intensive use), good sound quality (with the proviso that the set includes the most primitive \"fleas\", which is worth exchanging for something better), the quality of voice conversations after updating the software without reservations (one of the previous updates was defective and prevented normal updates and prevented normal updates conversations) provided Android update to version 6.0, the liquidity of the good interface (scrolling of the menu cage a bit and it is not)",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "5130808",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Użytkuję już od trzech lat. Nie znajduję wad. Ale - tak jak każdy smartphone- absolutnie musi mieć etui. Kupiłem jedno z tych pancernych. Telefon nie tylko pewniej leży w dłoni, ale także nie będę dzięki niemu zamierał, ilekroć wyleci z dłoni. Tylko tak się składa, że - choć pancerne etui ochrania telefon już od ładnych paru miesięcy - do jakichkolwiek upadków nie dochodzi - zasługa ochronnej obudowy, telefon nie jest już śliski.",
        "pros_pl": [
            "czas pracy na baterii",
            "wygląd"
        ],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-10-16 14:58:58",
        "purchased": null,
        "content_en": "I have been using for three years. I don't find flaws. But - just like any smartphone - it must have a case. I bought one of the armored ones. The phone not only lies in your hand more confidently, but I will not die thanks to it whenever I get out of my hand. It just so happens that - although the armored case has been protecting the phone for a few months - no falls come to any falls - the merit of the protective housing, the phone is no longer slippery.",
        "pros_en": [
            "battery life",
            "appearance"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "3802566",
        "author": "Biały",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "Produkt chodzi płynnie nie zawiesza się aplikacje ładują się szybko. Parę bajerów umila życie np. pulsometr oraz wodo- i pyło- odporność",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-06-30 11:14:46",
        "purchased": "2016-06-26 18:40:16",
        "content_en": "The product goes smoothly does not hang the applications load quickly. A few goodies are made more pleasant by life, e.g. a heart rate monitor and water and dust- resistance",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3691624",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "ok",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 3,
        "vote_no": 6,
        "published": "2016-04-13 12:14:49",
        "purchased": "2016-03-30 21:14:57",
        "content_en": "ok",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3634909",
        "author": "Rysio",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "ok",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 1,
        "vote_no": 6,
        "published": "2016-03-10 12:55:27",
        "purchased": "2016-02-19 12:40:22",
        "content_en": "ok",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3336762",
        "author": "Elżbieta",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "bardzo dobry",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 3,
        "vote_no": 11,
        "published": "2015-09-24 09:37:52",
        "purchased": "2015-09-16 12:10:22",
        "content_en": "very good",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3771522",
        "author": "Ania",
        "recommendation": null,
        "stars": 3.5,
        "content_pl": "Telefon z serii: fajny był jak był nowy. Niestety zawiodłam się bardzo na tym modelu w dłuższej perspektywie ponieważ ma problemy z łapaniem ostrości na zdjęciach, z tym że się często zacina i tym, robi czasem dziwne rzeczy takie jak odblokowuje się lub chce się wyłączyć z niewiadomych przyczyn. Fajny telefon ale nie jako odmiana flagowca, od tego poziomu (ceny) telefonu dużo więcej się wymaga. Kupiłam samsunga za namową znajomych i jako następny telefon na pewno samsunga nie wybiorę (albo wrócę do Sony, albo przejdę na iPhone)",
        "pros_pl": [
            "funkcjonalność"
        ],
        "cons_pl": [
            "po pół roku użytkowania się zawiesza"
        ],
        "vote_yes": 3,
        "vote_no": 0,
        "published": "2016-06-04 17:38:30",
        "purchased": null,
        "content_en": "The phone from the series: It was cool when he was new. Unfortunately, I was very disappointed in this model in the long run because it has problems with catching sharpness in the pictures, except that it often stresses and sometimes does strange things such as it unlocked or wants to turn off for unknown reasons. Nice phone but not as a flagship variety, much more is required from this level (price) of the phone. I bought Samsung at the instigation of my friends and as the next phone I will definitely not choose Samsung (either I will go back to Sony or go to the iPhone)",
        "pros_en": [
            "functionality"
        ],
        "cons_en": [
            "After half a year of use, it hangs"
        ]
    },
    {
        "opinion_id": "4560305",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Mam ten aparat od 1,5 roku. W zasadzie jako telefon działa bez zarzutu, lecz aparat robi niestety nieostre filmy. O ile zdjęcia są zadowalającej ostrości to filmy niestety nie.  Był 2 razy w serwisie gdzie wymieniono to co nie było powodem usterki, stwierdzili, że jest wszystko OK, a niestety nie jest.  Nie mam już sił dalej udowadniać z tą ostrością, Mam zamiar zmienić go na inną markę. \"Wyleczyłem \" się z samsunga.!!!!!",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-04-11 08:55:39",
        "purchased": null,
        "content_en": "I have had this camera for 1.5 years. In fact, as a phone, it works flawlessly, but the camera unfortunately makes blurred movies. While the photos are satisfactory, movies are unfortunately not.  He was twice on the site where what was not the reason for the fault, they said that everything was OK, but unfortunately it is not.  I have no more strength to prove with this sharpness, I intend to change it to another brand. \"I cured\" myself of Samsung. !!!!!",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4150190",
        "author": "Mariusz",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Samsung Galaxy S5 Neo który zakupiłem kilka dni temu sprawuje się bardzo dobrze, jest szybki, menu przejrzyste i estetyczne. Polecam.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-11-04 15:43:21",
        "purchased": "2016-10-25 21:28:30",
        "content_en": "Samsung Galaxy S5 Neo that I bought a few days ago works very well, is fast, transparent and aesthetic menu. I recommend.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3430797",
        "author": "Dawjd",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Godny polecenia !!!",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 28,
        "vote_no": 38,
        "published": "2015-11-21 14:42:41",
        "purchased": "2015-11-16 16:03:56",
        "content_en": "Recommendable !!!",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4034143",
        "author": "madebyme2212",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Jestem z niego bardzo zadowolona. Bateria trzyma 2 dni, zdjęcia ładne. Menu proste. Mogę z czystym sumieniem polecić ten model.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-10-11 11:33:40",
        "purchased": "2016-09-28 14:46:46",
        "content_en": "I am very happy with it. The battery holds 2 days, nice photos. Simple menu. I can recommend this model with a clear conscience.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3362748",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": 3.0,
        "content_pl": "Niestety w moim egzemplarzu jakość dzwięku w słuchawce też jest fatalna - głos jakby \"z tunelu\". Szczególnie jest to denerwujące bo w wiele straszym galaxy s 2 dzwięk był doskonały. W końcu telefon służy głównie do rozmów i wszystkie pozostałe zalety bledną przy tej wadzie. Ponadto co jakis czas pojawia się komunikat o niedomknietej tylnej obudowie. Czy może ktoś sobie z tym poradził bez oddawania do serwisu?",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 11,
        "vote_no": 10,
        "published": "2015-10-12 11:09:33",
        "purchased": null,
        "content_en": "Unfortunately, in my copy, the quality of the sound in the handset is also fatal - a voice like \"from the tunnel\". This is especially annoying because in a lot of scary Galaxy S 2 the sound was perfect. After all, the phone is mainly used for conversations and all other advantages pale with this flaw. In addition, from time to time a message appears about the closed rear housing. Or did someone deal with it without putting it in?",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3735102",
        "author": "Norbert",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Pierwsze wrażenie pozytywne. Czas pokaże czy takie odczucie zostanie na stałe.",
        "pros_pl": [
            "funkcjonalność"
        ],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-05-09 11:23:23",
        "purchased": "2016-05-01 16:01:26",
        "content_en": "The first positive impression. Time will tell if such a feeling will stay permanently.",
        "pros_en": [
            "functionality"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "3539450",
        "author": "An...",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "ok!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 2,
        "vote_no": 22,
        "published": "2016-01-19 10:07:59",
        "purchased": "2015-12-23 09:20:14",
        "content_en": "Ok !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3735610",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "1. Niezawodny.\r\n2. Szybki.\r\n3. Maksimum możliwości, jakich nie ma iphone.\r\n4. Wspaniały obraz.\r\n5. Dobry dźwięk.\r\n6. Wodoodporny - myślałem, że to zbędna zaleta, byłem w błędzie.\r\n7. Szalenie wydajna antena wifi.\r\n8. Radio (S6 na przykład nie ma!).\r\n9. Długa praca na jednym ładowaniu.\r\n\r\nMinusy? Tylna klapka nieco trzeszczy. Szczęśliwie z czasem owy dźwięk zanika.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 1,
        "vote_no": 0,
        "published": "2016-05-09 17:26:56",
        "purchased": null,
        "content_en": "1. Reliable.\r\n2. Fast.\r\n3. Maximum possibilities that the iPhone does not have.\r\n4. A great picture.\r\n5. Good sound.\r\n6. Waterproof - I thought it was an unnecessary advantage, I was wrong.\r\n7. A wicked WiFi antenna.\r\n8. Radio (S6, for example, is not there!).\r\n9. Long work on one charge.\r\n\r\nCons? The rear flap creaks slightly. Luckily, this sound disappears over time.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3330673",
        "author": "F",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "ekonomiczna ewolucja wersji s5... generalnie udany telefon w dobrej cenie. na plus nieco lepszy aparat, ale nieznacznie. brak pilota na podczerwień. Chodzi płynnie nie czuć braku mocy w normalnym użytkowaniu. Pod tym kątem prawie jak S6. Słabsze podzespoły ujawniają się dopiero przy grach. Oczywiście nie stanowią problemu. Jeśli ktoś ma jednak możliwość, niech wybierze lepiej \"stary\" S5.  Będzie to korzystniejsze. Menu w S5 o wiele bardziej bogate a działa równie dobrze. W całej sprawie ważna jest także polityka samsunga. .. który telefon dostanie   aktualizacje do androida M ???\nGdybym miał jeszcze raz wybierać to chyba jednak S5... ale nie żałuję, S5 neo jest równie Dobry!",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 4,
        "vote_no": 4,
        "published": "2015-09-20 08:13:53",
        "purchased": null,
        "content_en": "Economic evolution of the S5 version ... generally a successful phone at a good price. A slightly better camera, but slightly. No infrared remote control. It goes smoothly not to feel the lack of power in normal use. In this respect, almost like S6. Weaker components are only revealed in games. Of course, they are not a problem. However, if someone has the opportunity, let them choose the \"old\" S5 better.  It will be more favorable. The menu in S5 is much more rich and works equally well. Samsung's policy is also important in the whole matter. .. Which phone will get updates to Android m ???\nIf I had to choose again, I think S5 ... But I don't regret it, S5 NEO is equally good!",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3688463",
        "author": "Łukasz",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "Duży ekran, telefon w trybie oszczędzania energii trzyma 2-3 dni co wydaje mi się dobrym wynikiem.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 4,
        "vote_no": 2,
        "published": "2016-04-11 14:47:16",
        "purchased": "2016-03-30 22:05:22",
        "content_en": "A large screen, the phone in energy saving keeps 2-3 days, which seems to me a good result.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3453049",
        "author": "Krzysztof",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Zdecydowalem sie zakupic ten telefon w play. Jest naprawde.swietny. Tylko jedna podstawowa wada: rozmowcy mnie nie slysza!!! I nie tylko jeden rozmowca,ale praktycznie kazdy z kim rozmawiam...Mysle,ze po prostu wadliwe aparaty trafily do play i sa sprzedawane w promocyjnych cenach za zlotowke... Jesli producent zobliguje sie do poprawy jakosci rozmow telefon ma 5 gwiazdek u mnie☺☺☺",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 2,
        "published": "2015-12-03 18:27:33",
        "purchased": null,
        "content_en": "I decided to buy this phone at Play. It is really great. Only one basic disadvantage: the interviewers do not hear me !!! And not only one conversation, but virtually everyone who talks to ... I think that simply defective cameras went to Play and are sold at promotional prices for the rally ... if the manufacturer obliges to improve the quality of conversations, the phone has 5 stars at my country",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "5108502",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Mialem ten telefon od 2lat i mogę napisać że jest bardzo dobry.  Super aparat,  piękny ekran superamoled. Ale bateria mizerna…  ledwo starcza na caly dzien w 3g i do godziny rozmów. Nie zacina się nigdy ale nie jest demonem szybkości…  no i ta cena…  jest o 1000zl za drogi jak na dzisiejsze czasy.  Lepiej wybrać jakiegoś chińczyka o lepszej jakosci",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-10-08 13:45:01",
        "purchased": null,
        "content_en": "I had this phone for 2 years and I can write that it is very good.  Super camera, beautiful SuperMoled screen. But the miserable battery ... I can barely last for the whole day in 3g and up to an hour of conversations. It never jams but is not a speed demon ... and this price ... is 1000 PLN too expensive for today.  It is better to choose a Chinese with better quality",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3567617",
        "author": "PawelDudzic",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "super telefon",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 1,
        "vote_no": 16,
        "published": "2016-02-04 20:03:10",
        "purchased": "2016-01-08 16:55:24",
        "content_en": "great phone",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3315223",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": 3.0,
        "content_pl": "Wszystko ładnie pięknie tak jak na flagowca przystało (płynność systemu i super amoled) + dobrze działające radio FM, rzec by można super urządzenie. Niestety telefon (być może tylko mój egzemplarz) posiada fatalną jakość połączeń głosowych. Moi rozmówcy skarżą się, że bardzo słabo mnie słychać (jakby coś przysłaniało mikrofon, może wada mikrofonu) ja za to słyszałem ich głos wyraźnie ale chropowato. W porównaniu z moim starym galaxy core jakość rozmów jest fatalna. Nie wiem czy nie jest to spowodowane tym, że telefon jest wodoodporny, ale jeżeli tak to niestety bardzo na tym traci jakość fonii.",
        "pros_pl": [],
        "cons_pl": [
            "słaba jakość dźwięku z głośniczka"
        ],
        "vote_yes": 12,
        "vote_no": 15,
        "published": "2015-09-10 12:22:23",
        "purchased": null,
        "content_en": "Everything is nicely beautiful, as befits a flagship (system liquidity and Super AMOLED) + well -functioning FM radio, say a great device. Unfortunately, the phone (perhaps only my copy) has a terrible quality of voice calls. My interlocutors complain that I can hear very poorly (as if something was obscured by a microphone, maybe a microphone defect) I heard their voice clearly but rough. Compared to my old Galaxy Core, the quality of conversations is fatal. I do not know if it is due to the fact that the phone is waterproof, but if so, unfortunately it loses the quality of the phonia very much.",
        "pros_en": [],
        "cons_en": [
            "poor sound quality from the speaker"
        ]
    },
    {
        "opinion_id": "3473655",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": 3.0,
        "content_pl": "Telefon sam w sobie jest super ale jest jedna podstawowa sprawa która przekreśla go całkowicie. Jakosć rozmów. Rozmoę słychać tak jak by człowiek siedział w jakiejś beczce i w dodatku występuja zakłócenia. Telefon kupiłem trzy tygodnie temu w Saturnie. Szkoda było tylko wydanych 1500zł dlatego przestrzegam innych. Pozostałem funkcje bez zarzutu ale jak ktos już tutaj napisał wszystko blednie przy kiepskich rozmowach a do tego w zasadzie telefon służy.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 1,
        "vote_no": 5,
        "published": "2015-12-14 15:10:12",
        "purchased": null,
        "content_en": "The phone itself is great but there is one basic matter that completely crosses it. Some conversations. You can hear Rozosama as if a man is sitting in a barrel and in addition there are disturbances. I bought the phone three weeks ago at Saturn. It was only a pity spent by PLN 1,500, so I follow others. I remained flawless functions but as someone has already written everything here with bad conversations and the phone basically serves.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3480187",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "DO WSZYSTKICH MAJĄCYCH PROBLEM Z FATALNĄ JAKOŚCIĄ ROZMÓW!!!\r\nProblem leży po stronie operatora i dotyczy tylko PLAY! Wystarczy WYŁĄCZYĆ TRANSMISJĘ DANYCH i jakość diametralnie się zmienia!\r\nJest to wina PLAYa, który nic z tym nie robi i dotyczy to najnowszych softów Samsunga. Najwidoczniej szanowny operator nie nadąża za najnowszymi aktualizacjami Samsaunga i całkowicie olewa klientów!!!!!",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 17,
        "vote_no": 2,
        "published": "2015-12-17 08:51:17",
        "purchased": null,
        "content_en": "For all those with trouble with terrible conversations !!!\r\nThe problem lies with the operator and only applies to Play! Just turn off the data transmission and the quality changes radically!\r\nIt is Playa's fault, which does nothing about it and this applies to the latest Samsung software. Apparently, the honorable operator does not keep up with the latest Samsaang updates and completely oils customers !!!!!",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3515886",
        "author": "An...",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "oki !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 5,
        "vote_no": 32,
        "published": "2016-01-05 21:18:58",
        "purchased": null,
        "content_en": "Oki !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3567598",
        "author": "PawelDudzic",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "ok",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 2,
        "vote_no": 21,
        "published": "2016-02-04 19:55:18",
        "purchased": "2016-01-13 16:45:20",
        "content_en": "ok",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3579401",
        "author": "jolwia",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Moze być",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 16,
        "published": "2016-02-11 18:00:38",
        "purchased": "2016-02-06 16:32:14",
        "content_en": "May be",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3723896",
        "author": "daroha",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Dla mnie ważne: obsługuje usb OTG - DAC Ifi iDSD nano, bateria przy normalnym użytkowaniu 2-3 doby.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 12,
        "vote_no": 2,
        "published": "2016-05-01 19:09:45",
        "purchased": "2016-04-11 16:30:59",
        "content_en": "Important for me: it supports USB OTG - DAC IFI IDSD NANO, battery with normal use of 2-3 days.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "6565069",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Cały czas używam telefonów Samsung i jest to najlepszy model tej firmy.Za niewielkie {stosunkowo}pieniądze mam telefon który przewyższa wszystkie aparaty seri A i S6 iS7.Naprawdę polecam super telefon.",
        "pros_pl": [
            "bateria lądująca w godzine 100%",
            "czas pracy na baterii",
            "wododporność"
        ],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2018-02-07 13:27:09",
        "purchased": null,
        "content_en": "I use samsung phones all the time and this is the best model of this company. For a small {relatively} money I have a phone that exceeds all cameras Seri a and S6 is7. I really recommend a great phone.",
        "pros_en": [
            "battery landing 100%",
            "battery life",
            "resistance"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "6275279",
        "author": "mmyy66",
        "recommendation": null,
        "stars": 3.0,
        "content_pl": "Gdyby ktoś jeszcze raz zaproponował mi ten telefon, nie zdecydowałabym się na niego. \r\nTelefon już po pół roku użytkowania zaczął się zacinać, samoistne wyłączać lub po prostu ekran stawał się cały czarny (ani włączyć, ani wyłączyć), 2 x usunął mi całą muzykę oraz zdjęcia z telefonu.\r\nPo przywróceniu ustawień fabrycznych  stan się poprawiał na kilka dni, a później znów to samo. Zaletą jest,że telefon jest nie do pobicia. Po całym dniu zacinania, zdarzyło mi się nim rzucić o ścianę, a mimo wszystko telefon jest cały i nie ma na nim ani jednej rysy . (nie naklejałam szkła hartowanego). Zdarza się nim zrobić naprawdę profesjonalne zdjęcia (światło dzienne) jak \"załapie\". I ostatni pozytyw to bateria, która przy \"siedzeniu\" cały dzień na telefonie ( o ile pół dnia się nie zacina), spokojnie wytrzymuje do późnego wieczora.",
        "pros_pl": [
            "czas pracy na baterii",
            "ekran nie do zbicia",
            "łatwość obsługi",
            "wygląd"
        ],
        "cons_pl": [
            "bateria lądująca w godzine 100%",
            "funkcjonalność",
            "nie daje rady z wieloma aplikacjami",
            "sam nie raz się wyłączył",
            "zacina się"
        ],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-11-30 15:07:56",
        "purchased": null,
        "content_en": "If someone offered me this phone again, I wouldn't decide on it. \r\nAfter half a year of use, the phone began to stuck, turn off, or simply the screen became all black (neither turn on or off), 2 x removed all the music and photos from the phone.\r\nAfter restoring the factory settings, the condition improved for a few days, and then the same again. The advantage is that the phone is unbeatable. After a whole day of jamming, I happened to throw it against the wall, and yet the phone is all and there is not a single scratch on it. (I did not stick tempered glass). It happens to take really professional photos (daylight) like \"Into\". And the last positive is the battery, which, when \"seating\" all day on the phone (if it does not stutter half a day), calmly lasts until late evening.",
        "pros_en": [
            "battery life",
            "The screen is not beaten",
            "ease of use",
            "appearance"
        ],
        "cons_en": [
            "battery landing 100%",
            "functionality",
            "it can't cope with many applications",
            "He turned off himself more than once",
            "jam"
        ]
    },
    {
        "opinion_id": "3539255",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Okrojona wersja starej s 5 ale .... okrojenie  zrobione z głową/brak biometów, niedziałającego czytnika linii papilarnych  etc./ w mojej ocenie telefon wart uwagi, dobry aparat , bateria 2 - 3 dni, generalnie jak dla mnie super.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 2,
        "vote_no": 0,
        "published": "2016-01-19 08:40:18",
        "purchased": null,
        "content_en": "A stripped version of the old s 5 but .... cutting with head/ lack of biometers, a non -working fingerprint reader etc./ In my opinion, the phone worth attention, good camera, battery 2-3 days, generally great for me.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4003926",
        "author": "Jakub",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Jak na razie sprawuje się rewelacyjnie",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-10-03 17:10:08",
        "purchased": "2016-09-22 09:44:14",
        "content_en": "So far it works great",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3357096",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": 3.5,
        "content_pl": "Ogólnie telefon bardzo fajny...ale... ja również potwierdzam, że jakoś połączenia(głośnik) jest \"jak z akwarium\" - tragedia; mój poprzedni Samsung Galaxy Core to przy tym najwyższy model kina domowego!",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 2,
        "vote_no": 3,
        "published": "2015-10-07 22:48:42",
        "purchased": null,
        "content_en": "In general, the phone is very nice ... but ... I also confirm that somehow connections (speaker) is \"like from the aquarium\" - a tragedy; My previous Samsung Galaxy Core is the highest home cinema model!",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3694882",
        "author": "Stanisław",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "Tak, jak w opisie danych technicznych",
        "pros_pl": [
            "funkcjonalność"
        ],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 5,
        "published": "2016-04-15 08:50:41",
        "purchased": "2016-04-09 09:16:26",
        "content_en": "As in the description of technical data",
        "pros_en": [
            "functionality"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "3937689",
        "author": "Endriu",
        "recommendation": null,
        "stars": 3.5,
        "content_pl": "Ogólnie wszystko ok, ale jak dla mnie jest za cichy.",
        "pros_pl": [],
        "cons_pl": [
            "funkcjonalność"
        ],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-09-10 07:20:54",
        "purchased": "2016-08-30 09:16:53",
        "content_en": "In general, everything is ok, but it's too quiet for me.",
        "pros_en": [],
        "cons_en": [
            "functionality"
        ]
    },
    {
        "opinion_id": "4506974",
        "author": "Wonski",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Zajefajny telefonik za rozsądną cenę.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-03-20 20:59:47",
        "purchased": "2017-03-08 22:49:08",
        "content_en": "A cool phone at a reasonable price.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3793563",
        "author": "Łukasz",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Idealnie chodzi jest wszystko to co powinien zawierać ten telefon. Odświeżony S5 i jestem zadowolony.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-06-21 17:27:24",
        "purchased": "2016-06-09 18:55:33",
        "content_en": "It is ideal for everything that this phone should contain. Refreshed S5 and I'm happy.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4039110",
        "author": "RiK",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Telefon funkcjonalny, intuicyjne menu, fajne zdjęcia, dobrze leży w dłoni\r\nOgólnie bez zastrzeżeń",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-10-12 10:25:09",
        "purchased": "2016-09-23 09:30:38",
        "content_en": "Functional phone, intuitive menu, cool photos, it fits well in your hand\r\nGenerally no reservation",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3809255",
        "author": "Łukasz",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Co prawda jest to już starszy model, ale w zupełności spełnia moje oczekiwania. Nie przepadam za telefonami szklanymi i metalowymi, więc plastikowy tył telefonu oceniam jako plus. Bateria jak na parametry telefonu mogła by być trochę pojemniejsza, ale za to szybko się ładuje. Jasny ekran, pełny kolorów ekran (o ekranie można w zasadzie pisać w samych superlatywach).",
        "pros_pl": [
            "funkcjonalność"
        ],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-07-04 15:11:17",
        "purchased": "2016-06-28 15:38:06",
        "content_en": "It is true that it is already an older model, but it completely meets my expectations. I do not like glass and metal phones, so I assess the plastic back of the phone as a plus. The battery for the phone parameters could be a little more spacious, but it charges quickly. A bright screen, full screen color (you can basically write about the screen in superlatives).",
        "pros_en": [
            "functionality"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "3945464",
        "author": "sernik",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Spoko tel.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-09-13 19:42:56",
        "purchased": "2016-09-03 22:46:38",
        "content_en": "Cool tel.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3843363",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "telefon bardzo fajny przyjemnie się go trzyma w dłoni  ma bardzo fajny wyświetlacz aparat robi zacne zdjęcia moja ocena to 4,5 na 5",
        "pros_pl": [
            "funkcjonalność"
        ],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-07-25 22:38:01",
        "purchased": null,
        "content_en": "The phone is very nice nicely holding it in your hand has a very nice display, the camera takes good photos, my rating is 4.5 out of 5",
        "pros_en": [
            "functionality"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "3920337",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Nie słyszę problemów z jakością połączeń głosowych a słuch mam dobry. Przyznam, że wogóle telefony jak na ich cenę i zaawansowanie techniczne całej infrastruktury telefonicznej prezentują marną jakość rozmów. Dźwięk w telefonie jest lepszy od mojego poprzedniego telefonu, swoją drogą topowego, Sony Ericsson W995 więc nie mam zastrzeżeń. Poza tym za tą cenę telefon jest na prawdę dobry pod każdym względem. Najbardziej miło zaskoczył mnie aparat przedni.",
        "pros_pl": [
            "funkcjonalność",
            "wododporność"
        ],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-09-03 10:13:23",
        "purchased": null,
        "content_en": "I don't hear problems with the quality of voice connections and I have a good hearing. I admit that at all, phones as at the price and technical advancement of the entire telephone infrastructure present a poor quality of conversations. The sound on the phone is better than my previous phone, by the way top, Sony Ericsson W995 so I have no objections. Besides, for this price the phone is really good in every respect. The front camera surprised me the most.",
        "pros_en": [
            "functionality",
            "resistance"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "4148150",
        "author": "Pawel",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Ok",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-11-03 20:04:49",
        "purchased": "2016-10-22 23:19:04",
        "content_en": "Ok",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3572891",
        "author": "An...",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "OKI !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!1",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 2,
        "vote_no": 18,
        "published": "2016-02-08 14:46:12",
        "purchased": "2016-01-15 15:43:51",
        "content_en": "Oki !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! 1",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3745544",
        "author": "bartek",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "dobre",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 1,
        "vote_no": 3,
        "published": "2016-05-15 20:48:30",
        "purchased": "2016-04-25 10:01:20",
        "content_en": "Good",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "5130808",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Użytkuję już od trzech lat. Nie znajduję wad. Ale - tak jak każdy smartphone- absolutnie musi mieć etui. Kupiłem jedno z tych pancernych. Telefon nie tylko pewniej leży w dłoni, ale także nie będę dzięki niemu zamierał, ilekroć wyleci z dłoni. Tylko tak się składa, że - choć pancerne etui ochrania telefon już od ładnych paru miesięcy - do jakichkolwiek upadków nie dochodzi - zasługa ochronnej obudowy, telefon nie jest już śliski.",
        "pros_pl": [
            "czas pracy na baterii",
            "wygląd"
        ],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-10-16 14:58:58",
        "purchased": null,
        "content_en": "I have been using for three years. I don't find flaws. But - just like any smartphone - it must have a case. I bought one of the armored ones. The phone not only lies in your hand more confidently, but I will not die thanks to it whenever I get out of my hand. It just so happens that - although the armored case has been protecting the phone for a few months - no falls come to any falls - the merit of the protective housing, the phone is no longer slippery.",
        "pros_en": [
            "battery life",
            "appearance"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "3691624",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "ok",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 3,
        "vote_no": 6,
        "published": "2016-04-13 12:14:49",
        "purchased": "2016-03-30 21:14:57",
        "content_en": "ok",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "8054759",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Telefon mam od 3 lat . Działa jak mażenie . Przerzył wiele wypadków i działa jak nowy . Jak naj bardziej polecam ten telefon .",
        "pros_pl": [
            "bateria lądująca w godzine 100%",
            "czas pracy na baterii",
            "ekran nie do zbicia",
            "funkcjonalność",
            "łatwość obsługi",
            "po pół roku użytkowania się zawiesza",
            "przycisk home - trzeba mocno naciskać",
            "wady oprogramowania",
            "wygląd",
            "wyświetlacza:  design:  żywotność"
        ],
        "cons_pl": [
            "potrafi zamulac",
            "wododporność"
        ],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2018-06-16 12:56:54",
        "purchased": null,
        "content_en": "I have had the phone for 3 years. It works like a men. He has grown up many accidents and acts like new. I recommend this phone as much as possible.",
        "pros_en": [
            "battery landing 100%",
            "battery life",
            "The screen is not beaten",
            "functionality",
            "ease of use",
            "After half a year of use, it hangs",
            "Home button - you have to press hard",
            "Software disadvantages",
            "appearance",
            "Display: Design: Life"
        ],
        "cons_en": [
            "can sneak",
            "resistance"
        ]
    },
    {
        "opinion_id": "3634909",
        "author": "Rysio",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "ok",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 1,
        "vote_no": 6,
        "published": "2016-03-10 12:55:27",
        "purchased": "2016-02-19 12:40:22",
        "content_en": "ok",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3336762",
        "author": "Elżbieta",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "bardzo dobry",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 3,
        "vote_no": 11,
        "published": "2015-09-24 09:37:52",
        "purchased": "2015-09-16 12:10:22",
        "content_en": "very good",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4560305",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Mam ten aparat od 1,5 roku. W zasadzie jako telefon działa bez zarzutu, lecz aparat robi niestety nieostre filmy. O ile zdjęcia są zadowalającej ostrości to filmy niestety nie.  Był 2 razy w serwisie gdzie wymieniono to co nie było powodem usterki, stwierdzili, że jest wszystko OK, a niestety nie jest.  Nie mam już sił dalej udowadniać z tą ostrością, Mam zamiar zmienić go na inną markę. \"Wyleczyłem \" się z samsunga.!!!!!",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-04-11 08:55:39",
        "purchased": null,
        "content_en": "I have had this camera for 1.5 years. In fact, as a phone, it works flawlessly, but the camera unfortunately makes blurred movies. While the photos are satisfactory, movies are unfortunately not.  He was twice on the site where what was not the reason for the fault, they said that everything was OK, but unfortunately it is not.  I have no more strength to prove with this sharpness, I intend to change it to another brand. \"I cured\" myself of Samsung. !!!!!",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3430797",
        "author": "Dawjd",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Godny polecenia !!!",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 28,
        "vote_no": 38,
        "published": "2015-11-21 14:42:41",
        "purchased": "2015-11-16 16:03:56",
        "content_en": "Recommendable !!!",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "5080419",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Opinia po roku użytkowania. Na początku super, bateria trzymała cały dzień zabawy. Potem przez częste ładowanie bateria trzymała pare h. Po zakupie nowej oryginalnej znowu bez rewelacji. Nie wiem z czego to wynika. Przy uzywaniu od 7 rano o 15 już mam 15% a staram się wyłączać wszystko w tle i mam przyciemniony ekran. Czasami potrafi masakrycznie przycinać, ostatnio jeszcze bardziej. Nawet nie włączam trybu oszczędzania baterii bo wtedy lewo działa. Wyczyściłem telefon do 0 i bez rewelacji. Za to aparat na wielki plus",
        "pros_pl": [
            "funkcjonalność",
            "wygląd"
        ],
        "cons_pl": [
            "czas pracy na baterii"
        ],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-09-28 08:23:58",
        "purchased": null,
        "content_en": "Opinion after a year of use. Great at first, the battery kept all day of fun. Then, due to frequent charging, the battery was holding a few h. After buying a new original again without a revelation. I don't know what it results from. When using from 7 am at 15 am, I already have 15% and I try to turn off everything in the background and I have a darkened screen. Sometimes he can cut massacrely, recently even more. I don't even turn on the battery saving mode because then the left works. I cleaned the phone to 0 and without a revelation. But the camera is a big plus",
        "pros_en": [
            "functionality",
            "appearance"
        ],
        "cons_en": [
            "battery life"
        ]
    },
    {
        "opinion_id": "3362748",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": 3.0,
        "content_pl": "Niestety w moim egzemplarzu jakość dzwięku w słuchawce też jest fatalna - głos jakby \"z tunelu\". Szczególnie jest to denerwujące bo w wiele straszym galaxy s 2 dzwięk był doskonały. W końcu telefon służy głównie do rozmów i wszystkie pozostałe zalety bledną przy tej wadzie. Ponadto co jakis czas pojawia się komunikat o niedomknietej tylnej obudowie. Czy może ktoś sobie z tym poradził bez oddawania do serwisu?",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 11,
        "vote_no": 10,
        "published": "2015-10-12 11:09:33",
        "purchased": null,
        "content_en": "Unfortunately, in my copy, the quality of the sound in the handset is also fatal - a voice like \"from the tunnel\". This is especially annoying because in a lot of scary Galaxy S 2 the sound was perfect. After all, the phone is mainly used for conversations and all other advantages pale with this flaw. In addition, from time to time a message appears about the closed rear housing. Or did someone deal with it without putting it in?",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3539450",
        "author": "An...",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "ok!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 2,
        "vote_no": 22,
        "published": "2016-01-19 10:07:59",
        "purchased": "2015-12-23 09:20:14",
        "content_en": "Ok !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3884558",
        "author": "Waldi",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "super sprzęt",
        "pros_pl": [
            "funkcjonalność"
        ],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-08-16 19:33:40",
        "purchased": "2016-07-17 15:32:35",
        "content_en": "great equipment",
        "pros_en": [
            "functionality"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "3735610",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "1. Niezawodny.\r\n2. Szybki.\r\n3. Maksimum możliwości, jakich nie ma iphone.\r\n4. Wspaniały obraz.\r\n5. Dobry dźwięk.\r\n6. Wodoodporny - myślałem, że to zbędna zaleta, byłem w błędzie.\r\n7. Szalenie wydajna antena wifi.\r\n8. Radio (S6 na przykład nie ma!).\r\n9. Długa praca na jednym ładowaniu.\r\n\r\nMinusy? Tylna klapka nieco trzeszczy. Szczęśliwie z czasem owy dźwięk zanika.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 1,
        "vote_no": 0,
        "published": "2016-05-09 17:26:56",
        "purchased": null,
        "content_en": "1. Reliable.\r\n2. Fast.\r\n3. Maximum possibilities that the iPhone does not have.\r\n4. A great picture.\r\n5. Good sound.\r\n6. Waterproof - I thought it was an unnecessary advantage, I was wrong.\r\n7. A wicked WiFi antenna.\r\n8. Radio (S6, for example, is not there!).\r\n9. Long work on one charge.\r\n\r\nCons? The rear flap creaks slightly. Luckily, this sound disappears over time.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3453049",
        "author": "Krzysztof",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Zdecydowalem sie zakupic ten telefon w play. Jest naprawde.swietny. Tylko jedna podstawowa wada: rozmowcy mnie nie slysza!!! I nie tylko jeden rozmowca,ale praktycznie kazdy z kim rozmawiam...Mysle,ze po prostu wadliwe aparaty trafily do play i sa sprzedawane w promocyjnych cenach za zlotowke... Jesli producent zobliguje sie do poprawy jakosci rozmow telefon ma 5 gwiazdek u mnie☺☺☺",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 2,
        "published": "2015-12-03 18:27:33",
        "purchased": null,
        "content_en": "I decided to buy this phone at Play. It is really great. Only one basic disadvantage: the interviewers do not hear me !!! And not only one conversation, but virtually everyone who talks to ... I think that simply defective cameras went to Play and are sold at promotional prices for the rally ... if the manufacturer obliges to improve the quality of conversations, the phone has 5 stars at my country",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3881944",
        "author": "Daro",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Telefon O.K.",
        "pros_pl": [
            "funkcjonalność"
        ],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-08-14 14:18:31",
        "purchased": "2016-07-18 23:14:44",
        "content_en": "O.K.",
        "pros_en": [
            "functionality"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "5108502",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Mialem ten telefon od 2lat i mogę napisać że jest bardzo dobry.  Super aparat,  piękny ekran superamoled. Ale bateria mizerna…  ledwo starcza na caly dzien w 3g i do godziny rozmów. Nie zacina się nigdy ale nie jest demonem szybkości…  no i ta cena…  jest o 1000zl za drogi jak na dzisiejsze czasy.  Lepiej wybrać jakiegoś chińczyka o lepszej jakosci",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-10-08 13:45:01",
        "purchased": null,
        "content_en": "I had this phone for 2 years and I can write that it is very good.  Super camera, beautiful SuperMoled screen. But the miserable battery ... I can barely last for the whole day in 3g and up to an hour of conversations. It never jams but is not a speed demon ... and this price ... is 1000 PLN too expensive for today.  It is better to choose a Chinese with better quality",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3576803",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Witam! Czy problem z szumami podczas rozmowy został rozwiązany nową aktualizacją? Chcę zakupić ten telefon, ale z tego co czytam to spory problem. Pozdrawiam",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 1,
        "published": "2016-02-10 13:49:10",
        "purchased": null,
        "content_en": "Hello! Has the problem with noise during the conversation been solved by a new update? I want to buy this phone, but from what I read is a big problem. Regards",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3996099",
        "author": "Maciej",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Super telefon. Spełnia w pełni moje oczekiwania. Polecam",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-09-30 07:04:15",
        "purchased": "2016-09-19 09:44:52",
        "content_en": "Great phone. It fully meets my expectations. I recommend",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3567617",
        "author": "PawelDudzic",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "super telefon",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 1,
        "vote_no": 16,
        "published": "2016-02-04 20:03:10",
        "purchased": "2016-01-08 16:55:24",
        "content_en": "great phone",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3690613",
        "author": "Aneta",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Telefon godny polecenia. Odpowiednia jakość za odpowiednie pieniądze. Jest super",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 1,
        "vote_no": 4,
        "published": "2016-04-12 19:09:01",
        "purchased": "2016-04-06 23:00:10",
        "content_en": "The phone is recommended. Appropriate quality for the right money. It's great",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3473655",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": 3.0,
        "content_pl": "Telefon sam w sobie jest super ale jest jedna podstawowa sprawa która przekreśla go całkowicie. Jakosć rozmów. Rozmoę słychać tak jak by człowiek siedział w jakiejś beczce i w dodatku występuja zakłócenia. Telefon kupiłem trzy tygodnie temu w Saturnie. Szkoda było tylko wydanych 1500zł dlatego przestrzegam innych. Pozostałem funkcje bez zarzutu ale jak ktos już tutaj napisał wszystko blednie przy kiepskich rozmowach a do tego w zasadzie telefon służy.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 1,
        "vote_no": 5,
        "published": "2015-12-14 15:10:12",
        "purchased": null,
        "content_en": "The phone itself is great but there is one basic matter that completely crosses it. Some conversations. You can hear Rozosama as if a man is sitting in a barrel and in addition there are disturbances. I bought the phone three weeks ago at Saturn. It was only a pity spent by PLN 1,500, so I follow others. I remained flawless functions but as someone has already written everything here with bad conversations and the phone basically serves.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4003928",
        "author": "Jakub",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Jak na razie sprawuje się rewelacyjnie",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-10-03 17:10:48",
        "purchased": "2016-09-22 09:44:14",
        "content_en": "So far it works great",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3515886",
        "author": "An...",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "oki !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 5,
        "vote_no": 32,
        "published": "2016-01-05 21:18:58",
        "purchased": null,
        "content_en": "Oki !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3567598",
        "author": "PawelDudzic",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "ok",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 2,
        "vote_no": 21,
        "published": "2016-02-04 19:55:18",
        "purchased": "2016-01-13 16:45:20",
        "content_en": "ok",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3800701",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "świetnie sprawdza się w każdej sytuacji, dobry wyświetlacz i bateria, menu łatwe i ładne",
        "pros_pl": [
            "funkcjonalność"
        ],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-06-28 16:16:55",
        "purchased": null,
        "content_en": "Works great in every situation, a good display and battery, easy and nice menu",
        "pros_en": [
            "functionality"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "3579401",
        "author": "jolwia",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Moze być",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 16,
        "published": "2016-02-11 18:00:38",
        "purchased": "2016-02-06 16:32:14",
        "content_en": "May be",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3723896",
        "author": "daroha",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Dla mnie ważne: obsługuje usb OTG - DAC Ifi iDSD nano, bateria przy normalnym użytkowaniu 2-3 doby.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 12,
        "vote_no": 2,
        "published": "2016-05-01 19:09:45",
        "purchased": "2016-04-11 16:30:59",
        "content_en": "Important for me: it supports USB OTG - DAC IFI IDSD NANO, battery with normal use of 2-3 days.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "6565069",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Cały czas używam telefonów Samsung i jest to najlepszy model tej firmy.Za niewielkie {stosunkowo}pieniądze mam telefon który przewyższa wszystkie aparaty seri A i S6 iS7.Naprawdę polecam super telefon.",
        "pros_pl": [
            "bateria lądująca w godzine 100%",
            "czas pracy na baterii",
            "wododporność"
        ],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2018-02-07 13:27:09",
        "purchased": null,
        "content_en": "I use samsung phones all the time and this is the best model of this company. For a small {relatively} money I have a phone that exceeds all cameras Seri a and S6 is7. I really recommend a great phone.",
        "pros_en": [
            "battery landing 100%",
            "battery life",
            "resistance"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "5018265",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Produkt bardzo dobry, jedyny minus to krótko trzymająca bateria. Zdjęcia fajne :)",
        "pros_pl": [
            "funkcjonalność",
            "łatwość obsługi",
            "wygląd"
        ],
        "cons_pl": [
            "bateria lądująca w godzine 100%",
            "czas pracy na baterii",
            "wododporność"
        ],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-09-07 15:53:09",
        "purchased": null,
        "content_en": "A very good product, the only minus is the short -term battery. Cool photos :)",
        "pros_en": [
            "functionality",
            "ease of use",
            "appearance"
        ],
        "cons_en": [
            "battery landing 100%",
            "battery life",
            "resistance"
        ]
    },
    {
        "opinion_id": "3539255",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Okrojona wersja starej s 5 ale .... okrojenie  zrobione z głową/brak biometów, niedziałającego czytnika linii papilarnych  etc./ w mojej ocenie telefon wart uwagi, dobry aparat , bateria 2 - 3 dni, generalnie jak dla mnie super.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 2,
        "vote_no": 0,
        "published": "2016-01-19 08:40:18",
        "purchased": null,
        "content_en": "A stripped version of the old s 5 but .... cutting with head/ lack of biometers, a non -working fingerprint reader etc./ In my opinion, the phone worth attention, good camera, battery 2-3 days, generally great for me.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3357096",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": 3.5,
        "content_pl": "Ogólnie telefon bardzo fajny...ale... ja również potwierdzam, że jakoś połączenia(głośnik) jest \"jak z akwarium\" - tragedia; mój poprzedni Samsung Galaxy Core to przy tym najwyższy model kina domowego!",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 2,
        "vote_no": 3,
        "published": "2015-10-07 22:48:42",
        "purchased": null,
        "content_en": "In general, the phone is very nice ... but ... I also confirm that somehow connections (speaker) is \"like from the aquarium\" - a tragedy; My previous Samsung Galaxy Core is the highest home cinema model!",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3937689",
        "author": "Endriu",
        "recommendation": null,
        "stars": 3.5,
        "content_pl": "Ogólnie wszystko ok, ale jak dla mnie jest za cichy.",
        "pros_pl": [],
        "cons_pl": [
            "funkcjonalność"
        ],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-09-10 07:20:54",
        "purchased": "2016-08-30 09:16:53",
        "content_en": "In general, everything is ok, but it's too quiet for me.",
        "pros_en": [],
        "cons_en": [
            "functionality"
        ]
    },
    {
        "opinion_id": "3793563",
        "author": "Łukasz",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Idealnie chodzi jest wszystko to co powinien zawierać ten telefon. Odświeżony S5 i jestem zadowolony.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-06-21 17:27:24",
        "purchased": "2016-06-09 18:55:33",
        "content_en": "It is ideal for everything that this phone should contain. Refreshed S5 and I'm happy.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4039110",
        "author": "RiK",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Telefon funkcjonalny, intuicyjne menu, fajne zdjęcia, dobrze leży w dłoni\r\nOgólnie bez zastrzeżeń",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-10-12 10:25:09",
        "purchased": "2016-09-23 09:30:38",
        "content_en": "Functional phone, intuitive menu, cool photos, it fits well in your hand\r\nGenerally no reservation",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3843363",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "telefon bardzo fajny przyjemnie się go trzyma w dłoni  ma bardzo fajny wyświetlacz aparat robi zacne zdjęcia moja ocena to 4,5 na 5",
        "pros_pl": [
            "funkcjonalność"
        ],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-07-25 22:38:01",
        "purchased": null,
        "content_en": "The phone is very nice nicely holding it in your hand has a very nice display, the camera takes good photos, my rating is 4.5 out of 5",
        "pros_en": [
            "functionality"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "6236023",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Wspaniały talefon z wspaniałym aparatem plus bardzo dobre słuchawki dokanałowe",
        "pros_pl": [
            "bateria lądująca w godzine 100%",
            "czas pracy na baterii",
            "łatwość obsługi",
            "wododporność",
            "wygląd",
            "wyświetlacza:  design:  żywotność"
        ],
        "cons_pl": [
            "brak mhl",
            "możliwości podłączenia do tv",
            "potrafi zamulac",
            "przycisk home - trzeba mocno naciskać"
        ],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-11-21 18:02:15",
        "purchased": null,
        "content_en": "A great tape with a great camera plus very good in -ear headphones",
        "pros_en": [
            "battery landing 100%",
            "battery life",
            "ease of use",
            "resistance",
            "appearance",
            "Display: Design: Life"
        ],
        "cons_en": [
            "no MHL",
            "TEVERING TAKE",
            "can sneak",
            "Home button - you have to press hard"
        ]
    },
    {
        "opinion_id": "4310372",
        "author": "Użytkownik Ceneo",
        "recommendation": false,
        "stars": 0.5,
        "content_pl": "To jest mój  4 samsung coraz gorsze robi smartfonay. Tym razem odpadl mi lakier z ramki oczywiście nie upadł. Dzwoniłem do serwisu samsunga olał sprawę twierdząc że to moja wina. Uważajcie na ramki z których odpada lakier samoistnie.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-12-27 00:02:01",
        "purchased": null,
        "content_en": "This is my 4 samsung worse is getting smartphone. This time I fell off the varnish from the frame of course did not fall. I called the Samsung service, he was a matter of claiming that it was my fault. Watch out for the frames from which the varnish falls off spontaneously.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4038454",
        "author": "Wojcio",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Telefon spełnia oczekiwania.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-10-12 08:28:23",
        "purchased": "2016-09-30 14:52:36",
        "content_en": "The phone meets expectations.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4871924",
        "author": "M...a",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "W swoim życiu już kilka miałam i mogę szczerze powiedzieć, że jest to jeden z najlepszych. Mogę go z czystym sercem polecić.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-07-21 11:14:45",
        "purchased": null,
        "content_en": "I have already had a few in my life and I can honestly say that this is one of the best. I can recommend it with a pure heart.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3419095",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Wydajność, aparat, dźwięk idealne",
        "pros_pl": [
            "funkcjonalność"
        ],
        "cons_pl": [],
        "vote_yes": 3,
        "vote_no": 2,
        "published": "2015-11-15 20:04:27",
        "purchased": null,
        "content_en": "Performance, camera, perfect sound",
        "pros_en": [
            "functionality"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "3793362",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Procesor bardzo szybki, używam go od pół roku i ani razu się nie zaciął. Obsługuje wszystko i kilka apek na raz",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-06-21 13:49:15",
        "purchased": null,
        "content_en": "The processor is very fast, I have been using it for half a year and it has never been cut. Serves everything and a few apps at once",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "12167808",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Ok",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2020-04-16 18:18:16",
        "purchased": "2020-04-05 10:39:49",
        "content_en": "Ok",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3690615",
        "author": "Aneta",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Super telefon. Pełna satysfakcja. Polecam ten model",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 2,
        "vote_no": 7,
        "published": "2016-04-12 19:10:45",
        "purchased": "2016-04-06 23:00:10",
        "content_en": "Great phone. Full satisfaction. I recommend this model",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "8054759",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Telefon mam od 3 lat . Działa jak mażenie . Przerzył wiele wypadków i działa jak nowy . Jak naj bardziej polecam ten telefon .",
        "pros_pl": [
            "bateria lądująca w godzine 100%",
            "czas pracy na baterii",
            "ekran nie do zbicia",
            "funkcjonalność",
            "łatwość obsługi",
            "po pół roku użytkowania się zawiesza",
            "przycisk home - trzeba mocno naciskać",
            "wady oprogramowania",
            "wygląd",
            "wyświetlacza:  design:  żywotność"
        ],
        "cons_pl": [
            "potrafi zamulac",
            "wododporność"
        ],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2018-06-16 12:56:54",
        "purchased": null,
        "content_en": "I have had the phone for 3 years. It works like a men. He has grown up many accidents and acts like new. I recommend this phone as much as possible.",
        "pros_en": [
            "battery landing 100%",
            "battery life",
            "The screen is not beaten",
            "functionality",
            "ease of use",
            "After half a year of use, it hangs",
            "Home button - you have to press hard",
            "Software disadvantages",
            "appearance",
            "Display: Design: Life"
        ],
        "cons_en": [
            "can sneak",
            "resistance"
        ]
    },
    {
        "opinion_id": "3520485",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Dobry, funkcjonalny telefon.",
        "pros_pl": [
            "wododporność"
        ],
        "cons_pl": [],
        "vote_yes": 2,
        "vote_no": 0,
        "published": "2016-01-07 23:14:35",
        "purchased": null,
        "content_en": "A good, functional phone.",
        "pros_en": [
            "resistance"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "4666354",
        "author": "Łukasz",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "Rewelacyjny ekran piękne kolory nowoczesny wygląd i świetne parametry w rozsądnej cenie polecam",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-05-15 17:51:47",
        "purchased": null,
        "content_en": "Sensational screen beautiful colors modern look and great parameters at a reasonable price I recommend",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "5080419",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Opinia po roku użytkowania. Na początku super, bateria trzymała cały dzień zabawy. Potem przez częste ładowanie bateria trzymała pare h. Po zakupie nowej oryginalnej znowu bez rewelacji. Nie wiem z czego to wynika. Przy uzywaniu od 7 rano o 15 już mam 15% a staram się wyłączać wszystko w tle i mam przyciemniony ekran. Czasami potrafi masakrycznie przycinać, ostatnio jeszcze bardziej. Nawet nie włączam trybu oszczędzania baterii bo wtedy lewo działa. Wyczyściłem telefon do 0 i bez rewelacji. Za to aparat na wielki plus",
        "pros_pl": [
            "funkcjonalność",
            "wygląd"
        ],
        "cons_pl": [
            "czas pracy na baterii"
        ],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-09-28 08:23:58",
        "purchased": null,
        "content_en": "Opinion after a year of use. Great at first, the battery kept all day of fun. Then, due to frequent charging, the battery was holding a few h. After buying a new original again without a revelation. I don't know what it results from. When using from 7 am at 15 am, I already have 15% and I try to turn off everything in the background and I have a darkened screen. Sometimes he can cut massacrely, recently even more. I don't even turn on the battery saving mode because then the left works. I cleaned the phone to 0 and without a revelation. But the camera is a big plus",
        "pros_en": [
            "functionality",
            "appearance"
        ],
        "cons_en": [
            "battery life"
        ]
    },
    {
        "opinion_id": "4485407",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "Witam Produkt B. dobry ale nie wart usługi Orange, traci na wartości nie spełnia się w tej sieci",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-03-10 14:39:44",
        "purchased": null,
        "content_en": "Hello, product B. Good but not worth the Orange service, it loses its value does not meet in this network",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3628573",
        "author": "Kupujący",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Produkt godny polecenia",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 1,
        "vote_no": 4,
        "published": "2016-03-07 10:08:04",
        "purchased": "2016-02-16 11:04:25",
        "content_en": "Product worth recommending",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3884558",
        "author": "Waldi",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "super sprzęt",
        "pros_pl": [
            "funkcjonalność"
        ],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-08-16 19:33:40",
        "purchased": "2016-07-17 15:32:35",
        "content_en": "great equipment",
        "pros_en": [
            "functionality"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "3512343",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Jestem zadowolony po okresie jednego miesiąca użytkownikowania polecam \nJurek",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 2,
        "vote_no": 1,
        "published": "2016-01-04 12:56:12",
        "purchased": null,
        "content_en": "I am satisfied after a period of one month of user, I recommend it \nJurek",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "8096959",
        "author": "Sobol2018",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Myślę że w tej kwocie pieniężnej nie znajdziecie Państwo nic fajniejszego.\r\nPolecam",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2018-07-01 12:19:56",
        "purchased": null,
        "content_en": "I think you won't find anything cooler in this money.\r\nI recommend",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3881944",
        "author": "Daro",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Telefon O.K.",
        "pros_pl": [
            "funkcjonalność"
        ],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-08-14 14:18:31",
        "purchased": "2016-07-18 23:14:44",
        "content_en": "O.K.",
        "pros_en": [
            "functionality"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "4817152",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Używam od roku wszytko śmiga jak najlepiej. Poważny minus to bateria tak to POLECAM",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-07-04 16:57:25",
        "purchased": null,
        "content_en": "I have been using all the best for a year. A serious minus is the battery so I recommend it",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3576803",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Witam! Czy problem z szumami podczas rozmowy został rozwiązany nową aktualizacją? Chcę zakupić ten telefon, ale z tego co czytam to spory problem. Pozdrawiam",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 1,
        "published": "2016-02-10 13:49:10",
        "purchased": null,
        "content_en": "Hello! Has the problem with noise during the conversation been solved by a new update? I want to buy this phone, but from what I read is a big problem. Regards",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3606414",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Super telenonik z fajnymi podzespołami.Zero zacięć,bardzo szybki. każdemu polecam.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-02-26 16:46:06",
        "purchased": null,
        "content_en": "A great soaponik with cool components. A jam, very fast. I recommend it to everyone.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3996099",
        "author": "Maciej",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Super telefon. Spełnia w pełni moje oczekiwania. Polecam",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-09-30 07:04:15",
        "purchased": "2016-09-19 09:44:52",
        "content_en": "Great phone. It fully meets my expectations. I recommend",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3523201",
        "author": "Piotr",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Najwyższej jakości produkt,naprawdę świetna jakość obrazu i dźwięku.Warty polecenia.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 1,
        "published": "2016-01-09 17:31:21",
        "purchased": null,
        "content_en": "The highest quality product, really great image and sound quality. Conditioned commands.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3690613",
        "author": "Aneta",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Telefon godny polecenia. Odpowiednia jakość za odpowiednie pieniądze. Jest super",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 1,
        "vote_no": 4,
        "published": "2016-04-12 19:09:01",
        "purchased": "2016-04-06 23:00:10",
        "content_en": "The phone is recommended. Appropriate quality for the right money. It's great",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4003928",
        "author": "Jakub",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Jak na razie sprawuje się rewelacyjnie",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-10-03 17:10:48",
        "purchased": "2016-09-22 09:44:14",
        "content_en": "So far it works great",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4585183",
        "author": "nitusss",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Godny polecenia!!!!:)",
        "pros_pl": [
            "funkcjonalność"
        ],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-04-19 18:36:07",
        "purchased": null,
        "content_en": "Recommendable !!!! :)",
        "pros_en": [
            "functionality"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "4212573",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Telefon pierwsza klasa. Teraz trzeba sie przerzucić na galaxy s7 edge",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-11-18 17:35:04",
        "purchased": null,
        "content_en": "First class phone. Now you have to switch to Galaxy S7 Edge",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3800701",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "świetnie sprawdza się w każdej sytuacji, dobry wyświetlacz i bateria, menu łatwe i ładne",
        "pros_pl": [
            "funkcjonalność"
        ],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-06-28 16:16:55",
        "purchased": null,
        "content_en": "Works great in every situation, a good display and battery, easy and nice menu",
        "pros_en": [
            "functionality"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "6685532",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Super telefon!",
        "pros_pl": [
            "bateria lądująca w godzine 100%",
            "łatwość obsługi",
            "wygląd"
        ],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2018-03-07 22:30:59",
        "purchased": null,
        "content_en": "Great phone!",
        "pros_en": [
            "battery landing 100%",
            "ease of use",
            "appearance"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "7996412",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "Polecam mam 4 lata i działa bez zarzutów",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2018-05-28 10:20:11",
        "purchased": null,
        "content_en": "I recommend I am 4 years old and works fine",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3575177",
        "author": "Użytkownik Ceneo",
        "recommendation": false,
        "stars": 1.0,
        "content_pl": "Nie polecam. Niby telefon dobry ale bardzo szybko się grzeje przez co bateria robi się coraz słabsza i trzeba kupić nową. Telefon wyglądem nie powala a parametry ma takie same co inne telefony z tańszej półki.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 1,
        "vote_no": 9,
        "published": "2016-02-09 18:07:52",
        "purchased": null,
        "content_en": "I do not recommend. Like a good phone but it warms up very quickly, which makes the battery getting weaker and you have to buy a new one. The phone does not look with appearance and the parameters have the same as other telephones from the cheaper shelf.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "6645166",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "to jest super polecam.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2018-02-26 20:33:25",
        "purchased": null,
        "content_en": "This is great, I recommend it.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "5018265",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Produkt bardzo dobry, jedyny minus to krótko trzymająca bateria. Zdjęcia fajne :)",
        "pros_pl": [
            "funkcjonalność",
            "łatwość obsługi",
            "wygląd"
        ],
        "cons_pl": [
            "bateria lądująca w godzine 100%",
            "czas pracy na baterii",
            "wododporność"
        ],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-09-07 15:53:09",
        "purchased": null,
        "content_en": "A very good product, the only minus is the short -term battery. Cool photos :)",
        "pros_en": [
            "functionality",
            "ease of use",
            "appearance"
        ],
        "cons_en": [
            "battery landing 100%",
            "battery life",
            "resistance"
        ]
    },
    {
        "opinion_id": "6645154",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "to jest super polecam.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2018-02-26 20:31:44",
        "purchased": null,
        "content_en": "This is great, I recommend it.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3567631",
        "author": "PawelDudzic",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "telefon godny polecenia",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 2,
        "vote_no": 16,
        "published": "2016-02-04 20:11:03",
        "purchased": "2016-01-27 16:55:50",
        "content_en": "telephone worth recommending",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3319394",
        "author": "Krzysztof",
        "recommendation": null,
        "stars": 3.0,
        "content_pl": "Bardzo dobry telefon i akcesoria do telefonu firmy Samsung \npolecam ten telefon dobry do pracy i nie tylko",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 3,
        "vote_no": 12,
        "published": "2015-09-13 09:08:16",
        "purchased": null,
        "content_en": "Very good phone and accessories for samsung phone \nI recommend this phone good for work and more",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3463034",
        "author": "ja",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Polecam!!!",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 14,
        "vote_no": 36,
        "published": "2015-12-09 08:22:49",
        "purchased": "2015-11-18 10:11:05",
        "content_en": "I recommend!!!",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4962256",
        "author": "Ula",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Telefon ze świetnym aparatem i płynnością działania. Niestety obudowa jest mało wytrzymała. Miałam problem, jak większość znajomych, z głośnikiem - dopiero po aktualizacji słysząłam dobrze rozmówców. Bateria standardowo trzyma ok 1,5 dnia przy używaniu internetu i kilkunastu minutach grania w gry dziennie.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-08-21 11:31:45",
        "purchased": null,
        "content_en": "Telephone with great camera and liquidity. Unfortunately, the housing is not very durable. I had a problem, like most friends, with a speaker - only after the update did I hear the interlocutors well. The battery keeps about 1.5 days as standard when using the Internet and several minutes of playing games a day.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3372211",
        "author": "Użytkownik Ceneo",
        "recommendation": false,
        "stars": 1.5,
        "content_pl": "Zamiast s5 neo polecam sg j5. Koszt  750 zł a w użytkowaniu  prawie jak S5 neo. Brakuje mu co prawda paru rzeczy ale jakość połączeń  jest  super. Bateria trzyma 3 dni.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 6,
        "vote_no": 14,
        "published": "2015-10-18 16:07:05",
        "purchased": null,
        "content_en": "Instead of S5 Neo I recommend SG J5. Cost PLN 750 and in use almost like S5 Neo. He misses a few things, but the quality of the connections is great. The battery holds 3 days.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3498168",
        "author": "Użytkownik Ceneo",
        "recommendation": false,
        "stars": 2.0,
        "content_pl": "Telefon jest do wszystkiego tylko nie do dzwonienia. Jakość rozmów faaatalna.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 2,
        "vote_no": 5,
        "published": "2015-12-28 12:14:47",
        "purchased": null,
        "content_en": "The phone is not not to be called. The quality of Faaatal conversations.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3485855",
        "author": "Użytkownik Ceneo",
        "recommendation": false,
        "stars": 0.5,
        "content_pl": "tragiczna jakość rozmów, oddany do serwisu po raz kolejny, za każdym razem to samo.",
        "pros_pl": [
            "funkcjonalność"
        ],
        "cons_pl": [
            "bateria dwa dni trzyma przy dość intensy"
        ],
        "vote_yes": 1,
        "vote_no": 10,
        "published": "2015-12-19 22:01:53",
        "purchased": null,
        "content_en": "The tragic quality of conversations, devoted to the site once again, the same every time.",
        "pros_en": [
            "functionality"
        ],
        "cons_en": [
            "The battery holds for two days at a fairly intersection"
        ]
    },
    {
        "opinion_id": "6236023",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Wspaniały talefon z wspaniałym aparatem plus bardzo dobre słuchawki dokanałowe",
        "pros_pl": [
            "bateria lądująca w godzine 100%",
            "czas pracy na baterii",
            "łatwość obsługi",
            "wododporność",
            "wygląd",
            "wyświetlacza:  design:  żywotność"
        ],
        "cons_pl": [
            "brak mhl",
            "możliwości podłączenia do tv",
            "potrafi zamulac",
            "przycisk home - trzeba mocno naciskać"
        ],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-11-21 18:02:15",
        "purchased": null,
        "content_en": "A great tape with a great camera plus very good in -ear headphones",
        "pros_en": [
            "battery landing 100%",
            "battery life",
            "ease of use",
            "resistance",
            "appearance",
            "Display: Design: Life"
        ],
        "cons_en": [
            "no MHL",
            "TEVERING TAKE",
            "can sneak",
            "Home button - you have to press hard"
        ]
    },
    {
        "opinion_id": "4310372",
        "author": "Użytkownik Ceneo",
        "recommendation": false,
        "stars": 0.5,
        "content_pl": "To jest mój  4 samsung coraz gorsze robi smartfonay. Tym razem odpadl mi lakier z ramki oczywiście nie upadł. Dzwoniłem do serwisu samsunga olał sprawę twierdząc że to moja wina. Uważajcie na ramki z których odpada lakier samoistnie.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-12-27 00:02:01",
        "purchased": null,
        "content_en": "This is my 4 samsung worse is getting smartphone. This time I fell off the varnish from the frame of course did not fall. I called the Samsung service, he was a matter of claiming that it was my fault. Watch out for the frames from which the varnish falls off spontaneously.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3599873",
        "author": "Użytkownik Ceneo",
        "recommendation": false,
        "stars": 1.5,
        "content_pl": "Telefon z dużym czytelnym i czułym ekranem. Szybkość działania systemu dobra. Dużo pamięci. Tu się zalety kończą. Słaba bateria, zamotany system z dużą ilością wad. Niepotrzebna nakładka samsunga. Może to kwestia przyzwyczajenie ale wolałem poprzedniego androida.",
        "pros_pl": [],
        "cons_pl": [
            "funkcjonalność",
            "wady oprogramowania"
        ],
        "vote_yes": 2,
        "vote_no": 3,
        "published": "2016-02-23 14:06:35",
        "purchased": null,
        "content_en": "Telephone with a large legible and sensitive screen. The speed of the good system. A lot of memory. Here the advantages end. Poor battery, a soaked system with a lot of flaws. Unnecessary Samsung overlay. Maybe it's a matter of habit but I preferred the previous Android.",
        "pros_en": [],
        "cons_en": [
            "functionality",
            "Software disadvantages"
        ]
    },
    {
        "opinion_id": "4038454",
        "author": "Wojcio",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Telefon spełnia oczekiwania.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-10-12 08:28:23",
        "purchased": "2016-09-30 14:52:36",
        "content_en": "The phone meets expectations.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4871924",
        "author": "M...a",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "W swoim życiu już kilka miałam i mogę szczerze powiedzieć, że jest to jeden z najlepszych. Mogę go z czystym sercem polecić.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-07-21 11:14:45",
        "purchased": null,
        "content_en": "I have already had a few in my life and I can honestly say that this is one of the best. I can recommend it with a pure heart.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3636804",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Uzywam s 5 neo od okolo miesiaca tel moge polecic ladnie smiga nic sie nie wiesza jakosc polaczen dobra",
        "pros_pl": [
            "funkcjonalność"
        ],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-03-11 13:51:25",
        "purchased": null,
        "content_en": "I have been using S 5 Neo for about a month phone I can recommend smile, nothing hangs the quality of good",
        "pros_en": [
            "functionality"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "3419095",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Wydajność, aparat, dźwięk idealne",
        "pros_pl": [
            "funkcjonalność"
        ],
        "cons_pl": [],
        "vote_yes": 3,
        "vote_no": 2,
        "published": "2015-11-15 20:04:27",
        "purchased": null,
        "content_en": "Performance, camera, perfect sound",
        "pros_en": [
            "functionality"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "3793362",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Procesor bardzo szybki, używam go od pół roku i ani razu się nie zaciął. Obsługuje wszystko i kilka apek na raz",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-06-21 13:49:15",
        "purchased": null,
        "content_en": "The processor is very fast, I have been using it for half a year and it has never been cut. Serves everything and a few apps at once",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "12167808",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Ok",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2020-04-16 18:18:16",
        "purchased": "2020-04-05 10:39:49",
        "content_en": "Ok",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3690615",
        "author": "Aneta",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Super telefon. Pełna satysfakcja. Polecam ten model",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 2,
        "vote_no": 7,
        "published": "2016-04-12 19:10:45",
        "purchased": "2016-04-06 23:00:10",
        "content_en": "Great phone. Full satisfaction. I recommend this model",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3520485",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Dobry, funkcjonalny telefon.",
        "pros_pl": [
            "wododporność"
        ],
        "cons_pl": [],
        "vote_yes": 2,
        "vote_no": 0,
        "published": "2016-01-07 23:14:35",
        "purchased": null,
        "content_en": "A good, functional phone.",
        "pros_en": [
            "resistance"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "4666354",
        "author": "Łukasz",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "Rewelacyjny ekran piękne kolory nowoczesny wygląd i świetne parametry w rozsądnej cenie polecam",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-05-15 17:51:47",
        "purchased": null,
        "content_en": "Sensational screen beautiful colors modern look and great parameters at a reasonable price I recommend",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4485407",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "Witam Produkt B. dobry ale nie wart usługi Orange, traci na wartości nie spełnia się w tej sieci",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-03-10 14:39:44",
        "purchased": null,
        "content_en": "Hello, product B. Good but not worth the Orange service, it loses its value does not meet in this network",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3628573",
        "author": "Kupujący",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Produkt godny polecenia",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 1,
        "vote_no": 4,
        "published": "2016-03-07 10:08:04",
        "purchased": "2016-02-16 11:04:25",
        "content_en": "Product worth recommending",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3512343",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Jestem zadowolony po okresie jednego miesiąca użytkownikowania polecam \nJurek",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 2,
        "vote_no": 1,
        "published": "2016-01-04 12:56:12",
        "purchased": null,
        "content_en": "I am satisfied after a period of one month of user, I recommend it \nJurek",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "5134297",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Jeden z lepszych telefonow jakie wyszly na nasz rynek.",
        "pros_pl": [
            "bateria dwa dni trzyma przy dość intensy",
            "bateria lądująca w godzine 100%",
            "czas pracy na baterii",
            "łatwość obsługi",
            "wady oprogramowania",
            "wododporność",
            "wygląd",
            "wyświetlacza:  design:  żywotność"
        ],
        "cons_pl": [
            "potrafi zamulac",
            "słaba jakość dźwięku z głośniczka"
        ],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-10-17 17:48:36",
        "purchased": null,
        "content_en": "One of the better telephones that came to our market.",
        "pros_en": [
            "The battery holds for two days at a fairly intersection",
            "battery landing 100%",
            "battery life",
            "ease of use",
            "Software disadvantages",
            "resistance",
            "appearance",
            "Display: Design: Life"
        ],
        "cons_en": [
            "can sneak",
            "poor sound quality from the speaker"
        ]
    },
    {
        "opinion_id": "4233749",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "Funkcjonalny i prosty w obsłudze. Bateria wytrzymuje dość długi czas.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-11-25 16:11:52",
        "purchased": null,
        "content_en": "Functional and easy to use. The battery lasts a fairly long time.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "8096959",
        "author": "Sobol2018",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Myślę że w tej kwocie pieniężnej nie znajdziecie Państwo nic fajniejszego.\r\nPolecam",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2018-07-01 12:19:56",
        "purchased": null,
        "content_en": "I think you won't find anything cooler in this money.\r\nI recommend",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4233119",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "łądny z wyglądu, funkcjonalny, wytrzymały, jestem bardzo zadowolona",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-11-25 11:02:46",
        "purchased": null,
        "content_en": "Lodz in appearance, functional, durable, I am very happy",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4817152",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Używam od roku wszytko śmiga jak najlepiej. Poważny minus to bateria tak to POLECAM",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-07-04 16:57:25",
        "purchased": null,
        "content_en": "I have been using all the best for a year. A serious minus is the battery so I recommend it",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4234011",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "Ogólnie jest to bardzo dobry sprzęt jak na swoją półkę",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-11-25 18:07:58",
        "purchased": null,
        "content_en": "Overall, it is very good equipment for your shelf",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3606414",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Super telenonik z fajnymi podzespołami.Zero zacięć,bardzo szybki. każdemu polecam.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-02-26 16:46:06",
        "purchased": null,
        "content_en": "A great soaponik with cool components. A jam, very fast. I recommend it to everyone.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3469546",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "ja tesz polecam",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 1,
        "vote_no": 5,
        "published": "2015-12-11 17:37:42",
        "purchased": null,
        "content_en": "I recommend it",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3523201",
        "author": "Piotr",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Najwyższej jakości produkt,naprawdę świetna jakość obrazu i dźwięku.Warty polecenia.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 1,
        "published": "2016-01-09 17:31:21",
        "purchased": null,
        "content_en": "The highest quality product, really great image and sound quality. Conditioned commands.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "8273869",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2018-08-22 20:58:34",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "8096954",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2018-07-01 12:10:17",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "6578632",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2018-02-11 13:22:33",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3493452",
        "author": "Użytkownik Ceneo",
        "recommendation": false,
        "stars": 0.5,
        "content_pl": "Zawiodłem sie",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 1,
        "vote_no": 21,
        "published": "2015-12-24 21:02:47",
        "purchased": null,
        "content_en": "I was disappointed",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4585183",
        "author": "nitusss",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Godny polecenia!!!!:)",
        "pros_pl": [
            "funkcjonalność"
        ],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-04-19 18:36:07",
        "purchased": null,
        "content_en": "Recommendable !!!! :)",
        "pros_en": [
            "functionality"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "4212573",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Telefon pierwsza klasa. Teraz trzeba sie przerzucić na galaxy s7 edge",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-11-18 17:35:04",
        "purchased": null,
        "content_en": "First class phone. Now you have to switch to Galaxy S7 Edge",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4851042",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "4,5/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-07-14 13:08:11",
        "purchased": "2017-07-09 00:36:16",
        "content_en": "4.5/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4678242",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-05-18 18:56:55",
        "purchased": "2017-05-08 22:20:07",
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4666337",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "4,5/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-05-15 17:47:02",
        "purchased": null,
        "content_en": "4.5/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4597713",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-04-23 22:00:06",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4472191",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-03-04 16:01:35",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "6685532",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Super telefon!",
        "pros_pl": [
            "bateria lądująca w godzine 100%",
            "łatwość obsługi",
            "wygląd"
        ],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2018-03-07 22:30:59",
        "purchased": null,
        "content_en": "Great phone!",
        "pros_en": [
            "battery landing 100%",
            "ease of use",
            "appearance"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "4280017",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "4,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-12-12 10:58:22",
        "purchased": null,
        "content_en": "4.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "7996412",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "Polecam mam 4 lata i działa bez zarzutów",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2018-05-28 10:20:11",
        "purchased": null,
        "content_en": "I recommend I am 4 years old and works fine",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4234770",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-11-25 23:07:01",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3575177",
        "author": "Użytkownik Ceneo",
        "recommendation": false,
        "stars": 1.0,
        "content_pl": "Nie polecam. Niby telefon dobry ale bardzo szybko się grzeje przez co bateria robi się coraz słabsza i trzeba kupić nową. Telefon wyglądem nie powala a parametry ma takie same co inne telefony z tańszej półki.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 1,
        "vote_no": 9,
        "published": "2016-02-09 18:07:52",
        "purchased": null,
        "content_en": "I do not recommend. Like a good phone but it warms up very quickly, which makes the battery getting weaker and you have to buy a new one. The phone does not look with appearance and the parameters have the same as other telephones from the cheaper shelf.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4097980",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "4,5/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-10-24 20:49:28",
        "purchased": null,
        "content_en": "4.5/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3779877",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-06-11 14:18:12",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "6645166",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "to jest super polecam.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2018-02-26 20:33:25",
        "purchased": null,
        "content_en": "This is great, I recommend it.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3683287",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-04-08 18:39:58",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "6645154",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "to jest super polecam.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2018-02-26 20:31:44",
        "purchased": null,
        "content_en": "This is great, I recommend it.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3567631",
        "author": "PawelDudzic",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "telefon godny polecenia",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 2,
        "vote_no": 16,
        "published": "2016-02-04 20:11:03",
        "purchased": "2016-01-27 16:55:50",
        "content_en": "telephone worth recommending",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3655644",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-03-23 22:04:12",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3319394",
        "author": "Krzysztof",
        "recommendation": null,
        "stars": 3.0,
        "content_pl": "Bardzo dobry telefon i akcesoria do telefonu firmy Samsung \npolecam ten telefon dobry do pracy i nie tylko",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 3,
        "vote_no": 12,
        "published": "2015-09-13 09:08:16",
        "purchased": null,
        "content_en": "Very good phone and accessories for samsung phone \nI recommend this phone good for work and more",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3626390",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-03-06 12:39:39",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3619679",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-03-03 17:35:13",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3463034",
        "author": "ja",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Polecam!!!",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 14,
        "vote_no": 36,
        "published": "2015-12-09 08:22:49",
        "purchased": "2015-11-18 10:11:05",
        "content_en": "I recommend!!!",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3585567",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "4,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-02-16 08:50:38",
        "purchased": null,
        "content_en": "4.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4962256",
        "author": "Ula",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "Telefon ze świetnym aparatem i płynnością działania. Niestety obudowa jest mało wytrzymała. Miałam problem, jak większość znajomych, z głośnikiem - dopiero po aktualizacji słysząłam dobrze rozmówców. Bateria standardowo trzyma ok 1,5 dnia przy używaniu internetu i kilkunastu minutach grania w gry dziennie.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-08-21 11:31:45",
        "purchased": null,
        "content_en": "Telephone with great camera and liquidity. Unfortunately, the housing is not very durable. I had a problem, like most friends, with a speaker - only after the update did I hear the interlocutors well. The battery keeps about 1.5 days as standard when using the Internet and several minutes of playing games a day.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3520493",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-01-07 23:15:21",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3372211",
        "author": "Użytkownik Ceneo",
        "recommendation": false,
        "stars": 1.5,
        "content_pl": "Zamiast s5 neo polecam sg j5. Koszt  750 zł a w użytkowaniu  prawie jak S5 neo. Brakuje mu co prawda paru rzeczy ale jakość połączeń  jest  super. Bateria trzyma 3 dni.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 6,
        "vote_no": 14,
        "published": "2015-10-18 16:07:05",
        "purchased": null,
        "content_en": "Instead of S5 Neo I recommend SG J5. Cost PLN 750 and in use almost like S5 Neo. He misses a few things, but the quality of the connections is great. The battery holds 3 days.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3520481",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-01-07 23:09:18",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3498168",
        "author": "Użytkownik Ceneo",
        "recommendation": false,
        "stars": 2.0,
        "content_pl": "Telefon jest do wszystkiego tylko nie do dzwonienia. Jakość rozmów faaatalna.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 2,
        "vote_no": 5,
        "published": "2015-12-28 12:14:47",
        "purchased": null,
        "content_en": "The phone is not not to be called. The quality of Faaatal conversations.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3510796",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-01-03 19:11:33",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3502307",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2015-12-29 18:45:09",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3455136",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2015-12-04 22:52:58",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3485855",
        "author": "Użytkownik Ceneo",
        "recommendation": false,
        "stars": 0.5,
        "content_pl": "tragiczna jakość rozmów, oddany do serwisu po raz kolejny, za każdym razem to samo.",
        "pros_pl": [
            "funkcjonalność"
        ],
        "cons_pl": [
            "bateria dwa dni trzyma przy dość intensy"
        ],
        "vote_yes": 1,
        "vote_no": 10,
        "published": "2015-12-19 22:01:53",
        "purchased": null,
        "content_en": "The tragic quality of conversations, devoted to the site once again, the same every time.",
        "pros_en": [
            "functionality"
        ],
        "cons_en": [
            "The battery holds for two days at a fairly intersection"
        ]
    },
    {
        "opinion_id": "3442558",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2015-11-27 13:16:18",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3430751",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2015-11-21 13:41:11",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3599873",
        "author": "Użytkownik Ceneo",
        "recommendation": false,
        "stars": 1.5,
        "content_pl": "Telefon z dużym czytelnym i czułym ekranem. Szybkość działania systemu dobra. Dużo pamięci. Tu się zalety kończą. Słaba bateria, zamotany system z dużą ilością wad. Niepotrzebna nakładka samsunga. Może to kwestia przyzwyczajenie ale wolałem poprzedniego androida.",
        "pros_pl": [],
        "cons_pl": [
            "funkcjonalność",
            "wady oprogramowania"
        ],
        "vote_yes": 2,
        "vote_no": 3,
        "published": "2016-02-23 14:06:35",
        "purchased": null,
        "content_en": "Telephone with a large legible and sensitive screen. The speed of the good system. A lot of memory. Here the advantages end. Poor battery, a soaked system with a lot of flaws. Unnecessary Samsung overlay. Maybe it's a matter of habit but I preferred the previous Android.",
        "pros_en": [],
        "cons_en": [
            "functionality",
            "Software disadvantages"
        ]
    },
    {
        "opinion_id": "3430195",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2015-11-21 01:09:18",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3636804",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Uzywam s 5 neo od okolo miesiaca tel moge polecic ladnie smiga nic sie nie wiesza jakosc polaczen dobra",
        "pros_pl": [
            "funkcjonalność"
        ],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-03-11 13:51:25",
        "purchased": null,
        "content_en": "I have been using S 5 Neo for about a month phone I can recommend smile, nothing hangs the quality of good",
        "pros_en": [
            "functionality"
        ],
        "cons_en": []
    },
    {
        "opinion_id": "5134297",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "Jeden z lepszych telefonow jakie wyszly na nasz rynek.",
        "pros_pl": [
            "bateria dwa dni trzyma przy dość intensy",
            "bateria lądująca w godzine 100%",
            "czas pracy na baterii",
            "łatwość obsługi",
            "wady oprogramowania",
            "wododporność",
            "wygląd",
            "wyświetlacza:  design:  żywotność"
        ],
        "cons_pl": [
            "potrafi zamulac",
            "słaba jakość dźwięku z głośniczka"
        ],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-10-17 17:48:36",
        "purchased": null,
        "content_en": "One of the better telephones that came to our market.",
        "pros_en": [
            "The battery holds for two days at a fairly intersection",
            "battery landing 100%",
            "battery life",
            "ease of use",
            "Software disadvantages",
            "resistance",
            "appearance",
            "Display: Design: Life"
        ],
        "cons_en": [
            "can sneak",
            "poor sound quality from the speaker"
        ]
    },
    {
        "opinion_id": "4233749",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "Funkcjonalny i prosty w obsłudze. Bateria wytrzymuje dość długi czas.",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-11-25 16:11:52",
        "purchased": null,
        "content_en": "Functional and easy to use. The battery lasts a fairly long time.",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4233119",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "łądny z wyglądu, funkcjonalny, wytrzymały, jestem bardzo zadowolona",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-11-25 11:02:46",
        "purchased": null,
        "content_en": "Lodz in appearance, functional, durable, I am very happy",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4234011",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "Ogólnie jest to bardzo dobry sprzęt jak na swoją półkę",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-11-25 18:07:58",
        "purchased": null,
        "content_en": "Overall, it is very good equipment for your shelf",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3469546",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "ja tesz polecam",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 1,
        "vote_no": 5,
        "published": "2015-12-11 17:37:42",
        "purchased": null,
        "content_en": "I recommend it",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "8273869",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2018-08-22 20:58:34",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "8096954",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2018-07-01 12:10:17",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "6578632",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2018-02-11 13:22:33",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3493452",
        "author": "Użytkownik Ceneo",
        "recommendation": false,
        "stars": 0.5,
        "content_pl": "Zawiodłem sie",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 1,
        "vote_no": 21,
        "published": "2015-12-24 21:02:47",
        "purchased": null,
        "content_en": "I was disappointed",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4851042",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "4,5/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-07-14 13:08:11",
        "purchased": "2017-07-09 00:36:16",
        "content_en": "4.5/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4678242",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-05-18 18:56:55",
        "purchased": "2017-05-08 22:20:07",
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4666337",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "4,5/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-05-15 17:47:02",
        "purchased": null,
        "content_en": "4.5/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4597713",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-04-23 22:00:06",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4472191",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2017-03-04 16:01:35",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4280017",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "4,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-12-12 10:58:22",
        "purchased": null,
        "content_en": "4.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4234770",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-11-25 23:07:01",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "4097980",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.5,
        "content_pl": "4,5/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-10-24 20:49:28",
        "purchased": null,
        "content_en": "4.5/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3779877",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-06-11 14:18:12",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3683287",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-04-08 18:39:58",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3655644",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-03-23 22:04:12",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3626390",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-03-06 12:39:39",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3619679",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-03-03 17:35:13",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3585567",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 4.0,
        "content_pl": "4,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-02-16 08:50:38",
        "purchased": null,
        "content_en": "4.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3520493",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-01-07 23:15:21",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3520481",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-01-07 23:09:18",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3510796",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2016-01-03 19:11:33",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3502307",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2015-12-29 18:45:09",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3455136",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2015-12-04 22:52:58",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3442558",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2015-11-27 13:16:18",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3430751",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2015-11-21 13:41:11",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    },
    {
        "opinion_id": "3430195",
        "author": "Użytkownik Ceneo",
        "recommendation": true,
        "stars": 5.0,
        "content_pl": "5,0/5",
        "pros_pl": [],
        "cons_pl": [],
        "vote_yes": 0,
        "vote_no": 0,
        "published": "2015-11-21 01:09:18",
        "purchased": null,
        "content_en": "5.0/5",
        "pros_en": [],
        "cons_en": []
    }
]